Jour5/manuel.org
#+TITLE: Introduction à Haskell
#+STARTUP: fold
#+AUTHOR: Doc. Malik Koné
#+LANGUAGE: fr
#+LATEX_HEADER: \usepackage[french]{babel}
#+LATEX_HEADER: \usepackage[labelformat=empty]{caption}
#+LATEX_HEADER: \usepackage{verbatim}
#+LATEX_HEADER: \usepackage{hyperref}
#+OPTIONS: H:3 toc:2 num:t broken-links:t ^:{} date:t author:t title:t -:t


* Qu'est-ce que Haskell
** Préambule
Ce document n'aurait pas été possible sans le livre de Graham Hutton "Programming in Haskell (Cambridge, 2018)" ainsi que du [[https://www.futurelearn.com/courses/functional-programming-haskell][cours de futurLearn]] "progaming in Haskell"  et des [[https://github.com/WADAlliance/Haskell_Plutus_Course][notes du hackton Haskell et Plutus]] de WADA.  Merci

 
  Haskell est un langage programmation avancé, fonctionnel. Les fonctions y jouent un rôle très important.  On dit qu'elles sont de première classe.   En Haskell, la notion de type est centrale.   Un peu comme en mathématique toute fonction a un domaine de définition et un ensemble image.  Ils doivent être précisés avant de coder.

Nous donnons un aperçu des fonctions,  puis nous introduisons la notion de programmation fonctionnelle et nous présenterons les atouts majeurs de Haskell.
   
** Fonctions
 Une fonction Haskell est une relation entre un ou plusieurs paramètres (/argument/) et un résultat.   On la définit à l'aide d'une équation, comme suit~:

#+BEGIN_SRC haskell
double x = x + x
#+END_SRC

Ici, une fonction nommée `double` a un paramètre $x$ et renvoie le résultat $x + x$.
 
** Programmation fonctionnelle
La programmation fonctionnelle est un style de programmation qui favorise l'utilisation des fonctions.  Haskell est un langage fonctionnel parce les fonctions y jouent un rôle de premier plan.

Java, C++, Python  sont des langages  /impératifs/ parce qu'on y définit *comment faire* les calculs et non *quels résultats* avoir. Voici par exemple comment on programme la somme des entiers de $1$ à $n$ en style impératif,

#+BEGIN_SRC java
  int total = 0;
  for (int count = 1; count <= 1; count ++)
      total = total + count;
#+END_SRC
on décrit ci-dessus comment faire le calcul.

Voici un exemple du même programme avec un style fonctionnel.
#+BEGIN_SRC haskell
sum [1..n]
#+END_SRC
Ici, on définit ce que l'on veut comme résultat.  Pour cela, on fait appel à deux fonctions `[1..n]` qui renvoie la liste des entiers de $1$ à $n$ et ensuite à la fonction `sum`.

** Caractéristiques d'Haskell 
Voici quelqu'unes des caractéristiques du langage Haskell.  Il permet:
- les listes en compréhension
- les fonctions récursives,  c'est-à-dire des fonctions qui s'appellent elle-même.
- des programmes concis
- les fonctions de haut niveau (/higer-order functions/), des fonctions qui utilisent d'autre fonction comme paramètre ou résultat.
 c'est-à-dire qu'une fonction peut s'appliquer à une autre fonction.
- un typage évolué des entrées et sorties des fonctions
- une évaluation paresseuse (/lazy evalutation/), seuls les résultats utilisés sont calculés.

** Un peu d'histoire
Haskell découle du /lambda calculus/  développé dans les années 30 par Alonzo Church.   Il est aussi inspiré du Lisp (années 50), premier langage à base de liste.  Depuis 1987, il existe un comité pour le développement d'Haskell rassemblant des informaticiens de renom.  Au moins trois récipiendaires du prix ACM Turing Award ont participé au développement de Haskell.  Le langage est nomé en honneur à  Haskell Curry un logisticien Britanique.  

** Exemples de programmes Haskell

*** Faire la somme d'une liste de nombre
    On peut définir la fonction `somme` comme suit:
 #+BEGIN_SRC haskell
   somme [] = 0
   somme (n:ns) = n + somme ns
 #+END_SRC
et l'appeller ainsi:
 #+BEGIN_SRC haskell :results drawer
   somme [1,2,3]
 #+END_SRC


 En Haskell, toutes les fonctions ont un type. Celui de `somme` est :
 #+RESULTS:
 : somme :: Num a => [a] -> a

  Cela veut dire que pour une liste d'éléments de type `a` de la classe de type `Num`,  la fonction `somme` renvoie un seul élément de type `a`.   Il y a de nombreux types en Haskell et plusieurs types de nombres (ie. de la classe `Num`).

  Les types Haskell donnent des informations sur les fonctions. Ils permettent d'éviter beaucoup d'erreurs avant même l'exécution du programme.

*** Trier
Voici un autre exemple Haskell pour un programme de tri
#+BEGIN_SRC haskell -i
  tri_vite [] = []
  tri_vite (x:xs) = tri_vite plus_petits ++  [x] ++ tri_vite plus_grands
                 where
                   plus_petits = [a | a <- xs, a <= x]
                   plus_grands =  [b | b <- xs, b > x]
#+END_SRC
Nous reviendrons sur cet exemple plus tard.

* De quoi avons-nous besoin pour commencer ?
** GHCi : Glasgow Haskell Compilater Interactif 
Comme pour tout programme, il nous faut un éditeur de texte.  Celui avec lequel vous êtes le plus confortable est souvent le meilleur.  Ensuite il faut un compilateur Haskell.  Lorsque vous programmerez vous aurez donc deux fenêtres ouvertes. L'une avec l'éditeur, l'autre avec le compilateur.

Le compilateur que nous allons installer est le plus commun.  Il s'appelle [[https://www.haskell.org/downloads/][Glasgow Haskell Compilater (GHC)]].  Installez-le en suivant en suivant les instructions du lien.

La version interactive du compilateur est pratique pour apprendre et c'est ce que nous utiliserons pour notre cours.  Sachez toute fois que l'on peut compiler un programme de la façon suivante:
#+BEGIN_SRC bash  -i
ghc -O2 nom_du_programme.hs
#+END_SRC
ou encore 
#+BEGIN_SRC bash
ghc --make mon nom_du_programme.hs
#+END_SRC


  Une fois ghci installé, tester le.  Vous devriez voir quelque chose comme cela:
   #+BEGIN_SRC bash  -i
mlk@teur ~ $ ghci
GHCi, version 8.6.5: http://www.haskell.org/ghc/  :? for help
Prelude> 
   #+END_SRC

À gauche, '>' est l'invite de commande.   Vous voyez écrit aussi 'Prelude'.  C'est une bibliothèque de fonction chargé par défaut dans le compilateur.

Le système attend votre commande.  Essayer les commandes suivantes:

 #+BEGIN_SRC haskell
 > 2+3*4
 #+END_SRC

 #+RESULTS:
 : 14

 #+BEGIN_SRC haskell
 > (2+3)*4
 #+END_SRC

 #+RESULTS:
 : 20

 #+BEGIN_SRC haskell
 > sqrt (3^2 + 4^2)
 #+END_SRC

 #+RESULTS:
 : 5.0

** Prélude
La bibliothèque de départ d'Haskell contient un nombre important de fonctions, notamment des fonctions qui s'appliquent à des listes.   Les éléments des listes sont notés entre crochets, exemple
#+BEGIN_SRC haskell
[1,2,3,4,5]
#+END_SRC

Nous donnons ici les définitions et des exemples des fonctions les plus souvent utilisés.

*** head
 Sélectionne le premier élément d'une liste non vide

#+BEGIN_SRC haskell
head  [1,2,3,4,5]
#+END_SRC

#+RESULTS:
: 1

*** tail
 Enlève le premier élément d'une liste  mon vide.
#+BEGIN_SRC haskell
tail [1,2,3,4,5]
#+END_SRC

#+RESULTS:
: [2,3,4,5]

*** !! (index)
 Sélectionne le $n^{ième}$ élément d'une liste non vide.   Notez que le premier indice est 0.
#+BEGIN_SRC haskell
[1,2,3,4,5]  !! 2
#+END_SRC

#+RESULTS:
: 3

*** take
 Sélectionne les n premiers éléments d'une liste.
#+BEGIN_SRC haskell
take 3 [1,2,3,4,5]
#+END_SRC

#+RESULTS:
: [1,2,3]

*** drop
 Supprime les n premiers éléments d'une liste.
#+BEGIN_SRC haskell
drop 3 [1,2,3,4,5]
#+END_SRC

#+RESULTS:
: [4,5]

*** length
 Calcule la longueur d'une liste.
#+BEGIN_SRC haskell
length [1,2,3,4,5]
#+END_SRC

#+RESULTS:
: 5

*** sum
 Fait la somme d'une liste de nombre.
#+BEGIN_SRC haskell
sum [1,2,3,4,5]
#+END_SRC

#+RESULTS:
: 15

*** product
 Calcule le produit des éléments d'une liste.
#+BEGIN_SRC haskell
product [1,2,3,4,5]
#+END_SRC

