Jour5/manuel.tex
% Created 2023-02-11 sam. 10:13
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage[french]{babel}
\usepackage[labelformat=empty]{caption}
\usepackage{verbatim}
\usepackage{hyperref}
\author{Doc. Malik Koné}
\date{\today}
\title{Introduction à Haskell}
\hypersetup{
 pdfauthor={Doc. Malik Koné},
 pdftitle={Introduction à Haskell},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.4.6)}, 
 pdflang={French}}
\begin{document}

\maketitle
\setcounter{tocdepth}{2}
\tableofcontents



\section{Qu'est-ce que Haskell}
\label{sec:org3cf5073}
\subsection{Préambule}
\label{sec:org61fb428}
Ce document n'aurait pas été possible sans le livre de Graham Hutton "Programming in Haskell (Cambridge, 2018)" ainsi que du \href{https://www.futurelearn.com/courses/functional-programming-haskell}{cours de futurLearn} "progaming in Haskell"  et des \href{https://github.com/WADAlliance/Haskell\_Plutus\_Course}{notes du hackton Haskell et Plutus} de WADA.  Merci


Haskell est un langage programmation avancé, fonctionnel. Les fonctions y jouent un rôle très important.  On dit qu'elles sont de première classe.   En Haskell, la notion de type est centrale.   Un peu comme en mathématique toute fonction a un domaine de définition et un ensemble image.  Ils doivent être précisés avant de coder.

Nous donnons un aperçu des fonctions,  puis nous introduisons la notion de programmation fonctionnelle et nous présenterons les atouts majeurs de Haskell.

\subsection{Fonctions}
\label{sec:orgda3ee8b}
Une fonction Haskell est une relation entre un ou plusieurs paramètres (\emph{argument}) et un résultat.   On la définit à l'aide d'une équation, comme suit\textasciitilde{}:

\begin{verbatim}
double x = x + x
\end{verbatim}

Ici, une fonction nommée `double` a un paramètre \(x\) et renvoie le résultat \(x + x\).

\subsection{Programmation fonctionnelle}
\label{sec:orge90b8dd}
La programmation fonctionnelle est un style de programmation qui favorise l'utilisation des fonctions.  Haskell est un langage fonctionnel parce les fonctions y jouent un rôle de premier plan.

Java, C++, Python  sont des langages  \emph{impératifs} parce qu'on y définit \textbf{comment faire} les calculs et non \textbf{quels résultats} avoir. Voici par exemple comment on programme la somme des entiers de \(1\) à \(n\) en style impératif,

\begin{verbatim}
int total = 0;
for (int count = 1; count <= 1; count ++)
    total = total + count;
\end{verbatim}
on décrit ci-dessus comment faire le calcul.

Voici un exemple du même programme avec un style fonctionnel.
\begin{verbatim}
sum [1..n]
\end{verbatim}
Ici, on définit ce que l'on veut comme résultat.  Pour cela, on fait appel à deux fonctions `[1..n]` qui renvoie la liste des entiers de \(1\) à \(n\) et ensuite à la fonction `sum`.

\subsection{Caractéristiques d'Haskell}
\label{sec:org8b963ae}
Voici quelqu'unes des caractéristiques du langage Haskell.  Il permet:
\begin{itemize}
\item les listes en compréhension
\item les fonctions récursives,  c'est-à-dire des fonctions qui s'appellent elle-même.
\item des programmes concis
\item les fonctions de haut niveau (\emph{higer-order functions}), des fonctions qui utilisent d'autre fonction comme paramètre ou résultat.
c'est-à-dire qu'une fonction peut s'appliquer à une autre fonction.
\item un typage évolué des entrées et sorties des fonctions
\item une évaluation paresseuse (\emph{lazy evalutation}), seuls les résultats utilisés sont calculés.
\end{itemize}

\subsection{Un peu d'histoire}
\label{sec:org768b146}
Haskell découle du \emph{lambda calculus}  développé dans les années 30 par Alonzo Church.   Il est aussi inspiré du Lisp (années 50), premier langage à base de liste.  Depuis 1987, il existe un comité pour le développement d'Haskell rassemblant des informaticiens de renom.  Au moins trois récipiendaires du prix ACM Turing Award ont participé au développement de Haskell.  Le langage est nomé en honneur à  Haskell Curry un logisticien Britanique.  

\subsection{Exemples de programmes Haskell}
\label{sec:org73f3141}

\subsubsection{Faire la somme d'une liste de nombre}
\label{sec:org39aebf9}
On peut définir la fonction `somme` comme suit:
\begin{verbatim}
somme [] = 0
somme (n:ns) = n + somme ns
\end{verbatim}
et l'appeller ainsi:
\begin{verbatim}
somme [1,2,3]
\end{verbatim}


En Haskell, toutes les fonctions ont un type. Celui de `somme` est :
\begin{verbatim}
somme :: Num a => [a] -> a
\end{verbatim}


Cela veut dire que pour une liste d'éléments de type `a` de la classe de type `Num`,  la fonction `somme` renvoie un seul élément de type `a`.   Il y a de nombreux types en Haskell et plusieurs types de nombres (ie. de la classe `Num`).

Les types Haskell donnent des informations sur les fonctions. Ils permettent d'éviter beaucoup d'erreurs avant même l'exécution du programme.

\subsubsection{Trier}
\label{sec:org5d66497}
Voici un autre exemple Haskell pour un programme de tri
\begin{verbatim}
  tri_vite [] = []
  tri_vite (x:xs) = tri_vite plus_petits ++  [x] ++ tri_vite plus_grands
                 where
                   plus_petits = [a | a <- xs, a <= x]
                   plus_grands =  [b | b <- xs, b > x]
\end{verbatim}
Nous reviendrons sur cet exemple plus tard.

\section{De quoi avons-nous besoin pour commencer ?}
\label{sec:org28acb68}
\subsection{GHCi : Glasgow Haskell Compilater Interactif}
\label{sec:orgfa96fa9}
Comme pour tout programme, il nous faut un éditeur de texte.  Celui avec lequel vous êtes le plus confortable est souvent le meilleur.  Ensuite il faut un compilateur Haskell.  Lorsque vous programmerez vous aurez donc deux fenêtres ouvertes. L'une avec l'éditeur, l'autre avec le compilateur.

Le compilateur que nous allons installer est le plus commun.  Il s'appelle \href{https://www.haskell.org/downloads/}{Glasgow Haskell Compilater (GHC)}.  Installez-le en suivant en suivant les instructions du lien.

La version interactive du compilateur est pratique pour apprendre et c'est ce que nous utiliserons pour notre cours.  Sachez toute fois que l'on peut compiler un programme de la façon suivante:
\begin{verbatim}
ghc -O2 nom_du_programme.hs
\end{verbatim}
ou encore 
\begin{verbatim}
ghc --make mon nom_du_programme.hs
\end{verbatim}


Une fois ghci installé, tester le.  Vous devriez voir quelque chose comme cela:
\begin{verbatim}
mlk@teur ~ $ ghci
GHCi, version 8.6.5: http://www.haskell.org/ghc/  :? for help
Prelude> 
\end{verbatim}

À gauche, '>' est l'invite de commande.   Vous voyez écrit aussi 'Prelude'.  C'est une bibliothèque de fonction chargé par défaut dans le compilateur.

Le système attend votre commande.  Essayer les commandes suivantes:

\begin{verbatim}
> 2+3*4
\end{verbatim}

\begin{verbatim}
> (2+3)*4
\end{verbatim}

\begin{verbatim}
> sqrt (3^2 + 4^2)
\end{verbatim}

\subsection{Prélude}
\label{sec:orgf087ef9}
La bibliothèque de départ d'Haskell contient un nombre important de fonctions, notamment des fonctions qui s'appliquent à des listes.   Les éléments des listes sont notés entre crochets, exemple
\begin{verbatim}
[1,2,3,4,5]
\end{verbatim}

Nous donnons ici les définitions et des exemples des fonctions les plus souvent utilisés.

\subsubsection{head}
\label{sec:org625350d}
Sélectionne le premier élément d'une liste non vide

\begin{verbatim}
head  [1,2,3,4,5]
\end{verbatim}

\subsubsection{tail}
\label{sec:orge3ce91f}
Enlève le premier élément d'une liste  mon vide.
\begin{verbatim}
tail [1,2,3,4,5]
\end{verbatim}

\subsubsection{!! (index)}
\label{sec:orgcdbcaaa}
Sélectionne le \(n^{ième}\) élément d'une liste non vide.   Notez que le premier indice est 0.
\begin{verbatim}
[1,2,3,4,5]  !! 2
\end{verbatim}

\subsubsection{take}
\label{sec:org0365f96}
Sélectionne les n premiers éléments d'une liste.
\begin{verbatim}
take 3 [1,2,3,4,5]
\end{verbatim}

\subsubsection{drop}
\label{sec:org54f84fc}
Supprime les n premiers éléments d'une liste.
\begin{verbatim}
drop 3 [1,2,3,4,5]
\end{verbatim}

\subsubsection{length}
\label{sec:org38534bc}
Calcule la longueur d'une liste.
\begin{verbatim}
length [1,2,3,4,5]
\end{verbatim}

\subsubsection{sum}
\label{sec:orgcb1b862}
Fait la somme d'une liste de nombre.
\begin{verbatim}
sum [1,2,3,4,5]
\end{verbatim}

\subsubsection{product}
\label{sec:orgd56a01e}
Calcule le produit des éléments d'une liste.
\begin{verbatim}
product [1,2,3,4,5]
\end{verbatim}
