Jour5/manuel.org
*** ++ (concatène)
Concatène (ou rassemble) deux listes en une seule.
#+BEGIN_SRC haskell
[1,2,3] ++ [4,5]
#+END_SRC

#+RESULTS:
: [1,2,3,4,5]

*** reverse
 Renverse les éléments d'une liste.
#+BEGIN_SRC haskell
reverse [1,2,3,4,5]
#+END_SRC

#+RESULTS:
: [5,4,3,2,1]

 # Voir l'appendice pour une liste des fonctions les plus souvent utilisé de la bibliothèque standard prélude.

** Comment appeler une fonction
 Les paramètres d'une fonction sont simplement séparés par des espaces.    Les parenthèses précisent la priorité des opérations sachant que l'application d'une fonction est prioritaire sur les opérations standards mathématiques, ainsi :
#+BEGIN_SRC haskell
f a + b
#+END_SRC
veut dire $f(a) + b$ et non $f(a+b)$, et 
#+BEGIN_SRC haskell
f a b + c*d
#+END_SRC
veut dire $f(a, b) + cd$ et non $f(a,b+cd)$. 

Voici une table associant notation mathématique et notation Haskell

| notation mathématique  | notation Haskell |
|------------------------+------------------|
| $f(x)$                 | f x              |
| $f(x,y)$               | f x y            |
| $f(g(x))$              | f (g x)          |
| $f(x,g(y))$            | f x (g y)        |
| $f(x)g(y)$             | f x * g y        |

** Scripts Haskell
  Les scripts Haskell ont généralement pour extensions '.hs'.    
 Supposons que nous ayons le code suivant dans un fichier appelé 'test.hs'
 #+BEGIN_SRC haskell
   double x = x + x
   
   quadruple x = double (double x)
 #+END_SRC

 Ce programme  définit deux fonctions mai il n'affiche rien, et il ne demande rien à l'utilisateur non plus.
Pour tester les fonctions, il est pratique de l'ouvrir dans ghci  comme suit:
   #+BEGIN_SRC bash  -i
ghci test.hs
  #+END_SRC
 Cela va charger en mémoire les fonctions et nous pourront les appeler à l'intérieur de ghci
#+BEGIN_SRC haskell
> quadruple 10
40
> take (double 2) [1,2,3,4,5,6,7,8]
[1,2,3,4]
#+END_SRC

Noter que lorsque  nous effectuons une modification dans le fichier 'test.hs', `ghci` ne prend pas en compte automatiquement les modifications.  Il faut utiliser la commande `:reload` (avec les :).

Par exemple,  modifions 'test.hs' en lui ajoutant les deux fonctions suivantes:
#+BEGIN_SRC haskell
factorielle n = product [1..n]

moyenne ns = sum ns  `div` length ns
#+END_SRC
Puis dans ghci, il faut écrire avant de pouvoir tester les nouvelles fonctions.
#+BEGIN_SRC bash
> :reload
[1 of 1] Compiling Main             ( test.hs, interpreted )
Ok, one module loaded.

> factorielle 10
3628800
#+END_SRC

 Des commandes importantes de ghci à connaître sont :
 - :? ou :help,  pour afficher l'aide de ghci;
 - :browse /module/,  pour montrer toutes les définitions chargées par le module;
 - :doc /fonction/,  pour avoir la documenation d'une fonction;
 - :i ou :info /objet/, pour avoir des informations sur un object;
 - :l ou :load /fichier/, pour charger un module;
 - :q ou :quit,  pour sortir du ghci;
 - :r ou :reload /fichier/,  pour recharger un module qui vien d'être modifié;
 - :t ou :type /objet/,  pour connaître le type d'un objet.

Par exemple:
 #+BEGIN_SRC bash
 > :doc head
 #+END_SRC
renvoie
:  Extract the first element of a list, which must be non-empty.

** Règle de nommage des fonctions et des variables

 Le nom des fonctions et de leurs paramètres doivent commencer avec lettre une minuscule et peuvent ensuite contenir 0 ou plusieurs caractères suivant `a-zA-Z0-9'_` .

Comme dans tous langages de programmation, certains mots-clefs ont des significations spéciales et ils ne peuvent pas désigner des variables ou des fonctions. En Haskell ces mots sont les suivants:

: case class data default deriving do else foreing if import in infix infixl infixr instance let module newtype of the type where

*** Convention pour les noms de variables
Par convention, on appelle 'n', 'x', et 'cs' les variables qui contient respectivement des nombres, des valeurs quelconques et des caractères.
On ajoute 's' aux noms des variables pour désigner une liste ou un ensemble.  Par exemple,  on écrira `ns`  pour une liste de nombres, ou `xs`  pour une liste de variables quelconques et `css`  pour une liste de caractères.

***  Disposition du code
 Comme dans python,  Haskell utilise des espaces pour grouper les expressions ensemble.  Dans le code ci-dessous,
#+BEGIN_SRC haskell -i
  a = b + c
      where
        b = 1
        c = 2

  d = a * 2
#+END_SRC
`b` et `c` sont des variables définies localement dans la fonction `a`.

 On peut rajouter des accolades et séparer les définitions avec des ;.
#+BEGIN_SRC haskell
  a = b + c
      where
        {b = 1;
         c = 2};
  
  d = a * 2;
#+END_SRC
Ce qui permet dde réécrire le code sur une seule ligne.
#+BEGIN_SRC haskell
  a=b+c where {b=1; c=2}; d=a*2;
#+END_SRC

**** Indentation
Comme les éditeurs de texte interprètent différemment les tabulations,  il est préférable d'utiliser des espaces plutôt que des tabulations, pour l'indentation.   L'idéal et que son éditeur transforme automatiquement les tabulations en espaces.

Par convention on utilise 8 espaces pour indenter le code.

**** Commentaires
***** Simples

 Les commentaires simples commencent avec le symbole `--`.   Ils doivent tenir sur une ligne, comme ci-dessous:
#+BEGIN_SRC haskell
-- Factorielle des n premiers entiers
factorielle n = product [1..n]
#+END_SRC

***** Imbriqués
 Les commentaires imbriqués sont encadrés par `{-` et `-}`.
 Ils peuvent s'étendre sur plusieurs lignes et contenir des commentaires.   Ils sont pratiques pour commenter  des blocs de code entiers, comme ci-dessous:
#+BEGIN_SRC haskell
  {-  3 fonctions du fichier test.hs commentées
  
  double x = x + x
  
  quadruple x = double (double x)
  
  -- Factorielle des n premiers entiers
  factorielle n = product [1..n]
  -}
  
  moyenne ns = sum ns  `div` length ns 
#+END_SRC

Voyons maintenant plus en détail ce qui fait l'une des forces de Haskell, son système de typage.

** Exercices 

*** Exercice n°1
 Mettez les parenthèses sur les expressions numéériques suivantes
 $2^3*4$, $2*3+4*5$  et $2+3*4^5$

*** Exercice n°2
 Corrigez les trois erreurs de syntaxe dans le script ci-dessous et vérifiez qu'il fonctionne dans `ghci`
#+BEGIN_SRC haskell
  N = a 'div' length xs
      where 
        a = 10
       xs = [1,2,3,4,5]
#+END_SRC

 Écrire ce script en une seule ligne.


*** Exercice n°3
 La fonction `init` renvoie la dernière partie d'une liste par exemple
#+BEGIN_SRC haskell
init [1,2,3,4,5]
#+END_SRC
: [1,2,3,4]

 Définissez cette fonction de deux façons différentes avec les fonctions vu dans ce chapitre

* Types et Classes de type
Commençons par définir les types de base, puis ceux des listes et des fonctions.  Nous finirons en parlant dans classe de types.  

On utilisera la commande ':t' dans ghci pour voir les types des objets.

** Types de base
Les types suivant  sont définis par défaut dans /Prelude/.

*** Bool -- les booléens
#+BEGIN_SRC haskell
:t True
#+END_SRC

#+RESULTS:
: True :: Bool

#+BEGIN_SRC haskell
  :t False 
#+END_SRC

#+RESULTS:
: False :: Bool

 Lorsque l'on demande  le type de `True` ou `False`  la réponse est `Bool`.   En Haskell, tous ce qui suit les symboles `::` indique le type de l'objet.

Les opérateurs classiques sur les booléens sont `&&`, `||` et `not`.

