Jour5/manuel.tex

\subsubsection{++ (concatène)}
\label{sec:orgd78acad}
Concatène (ou rassemble) deux listes en une seule.
\begin{verbatim}
[1,2,3] ++ [4,5]
\end{verbatim}

\subsubsection{reverse}
\label{sec:orgc44a8bf}
Renverse les éléments d'une liste.
\begin{verbatim}
reverse [1,2,3,4,5]
\end{verbatim}

\subsection{Comment appeler une fonction}
\label{sec:orgb0da816}
Les paramètres d'une fonction sont simplement séparés par des espaces.    Les parenthèses précisent la priorité des opérations sachant que l'application d'une fonction est prioritaire sur les opérations standards mathématiques, ainsi :
\begin{verbatim}
f a + b
\end{verbatim}
veut dire \(f(a) + b\) et non \(f(a+b)\), et 
\begin{verbatim}
f a b + c*d
\end{verbatim}
veut dire \(f(a, b) + cd\) et non \(f(a,b+cd)\). 

Voici une table associant notation mathématique et notation Haskell

\begin{center}
\begin{tabular}{ll}
notation mathématique & notation Haskell\\
\hline
\(f(x)\) & f x\\
\(f(x,y)\) & f x y\\
\(f(g(x))\) & f (g x)\\
\(f(x,g(y))\) & f x (g y)\\
\(f(x)g(y)\) & f x * g y\\
\end{tabular}
\end{center}

\subsection{Scripts Haskell}
\label{sec:org9c8daaa}
 Les scripts Haskell ont généralement pour extensions '.hs'.    
Supposons que nous ayons le code suivant dans un fichier appelé 'test.hs'
\begin{verbatim}
double x = x + x

quadruple x = double (double x)
\end{verbatim}

 Ce programme  définit deux fonctions mai il n'affiche rien, et il ne demande rien à l'utilisateur non plus.
Pour tester les fonctions, il est pratique de l'ouvrir dans ghci  comme suit:
\begin{verbatim}
ghci test.hs
\end{verbatim}
Cela va charger en mémoire les fonctions et nous pourront les appeler à l'intérieur de ghci
\begin{verbatim}
> quadruple 10
40
> take (double 2) [1,2,3,4,5,6,7,8]
[1,2,3,4]
\end{verbatim}

Noter que lorsque  nous effectuons une modification dans le fichier 'test.hs', `ghci` ne prend pas en compte automatiquement les modifications.  Il faut utiliser la commande `:reload` (avec les :).

Par exemple,  modifions 'test.hs' en lui ajoutant les deux fonctions suivantes:
\begin{verbatim}
factorielle n = product [1..n]

moyenne ns = sum ns  `div` length ns
\end{verbatim}
Puis dans ghci, il faut écrire avant de pouvoir tester les nouvelles fonctions.
\begin{verbatim}
> :reload
[1 of 1] Compiling Main             ( test.hs, interpreted )
Ok, one module loaded.

> factorielle 10
3628800
\end{verbatim}

Des commandes importantes de ghci à connaître sont :
\begin{itemize}
\item :? ou :help,  pour afficher l'aide de ghci;
\item :browse \emph{module},  pour montrer toutes les définitions chargées par le module;
\item :doc \emph{fonction},  pour avoir la documenation d'une fonction;
\item :i ou :info \emph{objet}, pour avoir des informations sur un object;
\item :l ou :load \emph{fichier}, pour charger un module;
\item :q ou :quit,  pour sortir du ghci;
\item :r ou :reload \emph{fichier},  pour recharger un module qui vien d'être modifié;
\item :t ou :type \emph{objet},  pour connaître le type d'un objet.
\end{itemize}

Par exemple:
\begin{verbatim}
> :doc head
\end{verbatim}
renvoie
\begin{verbatim}
Extract the first element of a list, which must be non-empty.
\end{verbatim}

\subsection{Règle de nommage des fonctions et des variables}
\label{sec:org9e1b0ff}

Le nom des fonctions et de leurs paramètres doivent commencer avec lettre une minuscule et peuvent ensuite contenir 0 ou plusieurs caractères suivant `a-zA-Z0-9'\_` .

Comme dans tous langages de programmation, certains mots-clefs ont des significations spéciales et ils ne peuvent pas désigner des variables ou des fonctions. En Haskell ces mots sont les suivants:

\begin{verbatim}
case class data default deriving do else foreing if import in infix infixl infixr instance let module newtype of the type where
\end{verbatim}

\subsubsection{Convention pour les noms de variables}
\label{sec:org6df80a2}
Par convention, on appelle 'n', 'x', et 'cs' les variables qui contient respectivement des nombres, des valeurs quelconques et des caractères.
On ajoute 's' aux noms des variables pour désigner une liste ou un ensemble.  Par exemple,  on écrira `ns`  pour une liste de nombres, ou `xs`  pour une liste de variables quelconques et `css`  pour une liste de caractères.

\subsubsection{Disposition du code}
\label{sec:orgd67577f}
Comme dans python,  Haskell utilise des espaces pour grouper les expressions ensemble.  Dans le code ci-dessous,
\begin{verbatim}
  a = b + c
      where
        b = 1
        c = 2

  d = a * 2
\end{verbatim}
`b` et `c` sont des variables définies localement dans la fonction `a`.

On peut rajouter des accolades et séparer les définitions avec des ;.
\begin{verbatim}
a = b + c
    where
      {b = 1;
       c = 2};

d = a * 2;
\end{verbatim}
Ce qui permet dde réécrire le code sur une seule ligne.
\begin{verbatim}
a=b+c where {b=1; c=2}; d=a*2;
\end{verbatim}

\begin{enumerate}
\item Indentation
\label{sec:org39c8b3f}
Comme les éditeurs de texte interprètent différemment les tabulations,  il est préférable d'utiliser des espaces plutôt que des tabulations, pour l'indentation.   L'idéal et que son éditeur transforme automatiquement les tabulations en espaces.

Par convention on utilise 8 espaces pour indenter le code.

\item Commentaires
\label{sec:org8b9c13d}
\begin{enumerate}
\item Simples
\label{sec:org6f5a35a}

Les commentaires simples commencent avec le symbole `--`.   Ils doivent tenir sur une ligne, comme ci-dessous:
\begin{verbatim}
-- Factorielle des n premiers entiers
factorielle n = product [1..n]
\end{verbatim}

\item Imbriqués
\label{sec:orgb278237}
Les commentaires imbriqués sont encadrés par `\{-` et `-\}`.
Ils peuvent s'étendre sur plusieurs lignes et contenir des commentaires.   Ils sont pratiques pour commenter  des blocs de code entiers, comme ci-dessous:
\begin{verbatim}
{-  3 fonctions du fichier test.hs commentées

double x = x + x

quadruple x = double (double x)

-- Factorielle des n premiers entiers
factorielle n = product [1..n]
-}

moyenne ns = sum ns  `div` length ns 
\end{verbatim}

Voyons maintenant plus en détail ce qui fait l'une des forces de Haskell, son système de typage.
\end{enumerate}
\end{enumerate}

\subsection{Exercices}
\label{sec:org85dcc66}

\subsubsection{Exercice n°1}
\label{sec:orge289546}
Mettez les parenthèses sur les expressions numériques suivantes
\(2^3*4\), \(2*3+4*5\)  et \(2+3*4^5\)

\subsubsection{Exercice n°2}
\label{sec:org0b6b81e}
Corrigez les trois erreurs de syntaxe dans le script ci-dessous et vérifiez qu'il fonctionne dans `ghci`
\begin{verbatim}
N = a 'div' length xs
    where 
      a = 10
     xs = [1,2,3,4,5]
\end{verbatim}

Écrire ce script en une seule ligne.


\subsubsection{Exercice n°3}
\label{sec:orgbdda6ef}
La fonction `init` renvoie la dernière partie d'une liste par exemple
\begin{verbatim}
init [1,2,3,4,5]
\end{verbatim}
\begin{verbatim}
[1,2,3,4]
\end{verbatim}


Définissez cette fonction de deux façons différentes avec les fonctions vu dans ce chapitre

\section{Types et Classes de type}
\label{sec:orge873c4f}
Commençons par définir les types de base, puis ceux des listes et des fonctions.  Nous finirons en parlant dans classe de types.  

On utilisera la commande ':t' dans ghci pour voir les types des objets.

\subsection{Types de base}
\label{sec:orgfca61b7}
Les types suivant  sont définis par défaut dans \emph{Prelude}.

\subsubsection{Bool -- les booléens}
\label{sec:org04e34d8}
\begin{verbatim}
:t True
\end{verbatim}

\begin{verbatim}
:t False 
\end{verbatim}

Lorsque l'on demande  le type de `True` ou `False`  la réponse est `Bool`.   En Haskell, tous ce qui suit les symboles `::` indique le type de l'objet.

Les opérateurs classiques sur les booléens sont `\&\&`, `||` et `not`.
