Jour5/manuel.org
*** Char -- caractères
 On utilise les guillemets simples pour noter un caractère.
#+BEGIN_SRC haskell
:t 'a'
#+END_SRC

#+RESULTS:
: 'a' :: Char

On peut aussi utiliser la valeur numérique (décimal ou hexadécimal) telle que définie par [[https://en.wikipedia.org/wiki/List_of_Unicode_characters#Latin_script][le standard unicode]].   Cela est utile pour saisir des caractères de contrôles, comme '@@latex:$\backslash{}$n@@' (nouvelle ligne) ou '@@latex:$\backslash{}$t@@' (tabulation).



#+BEGIN_SRC haskell
:t '\97'
#+END_SRC

#+RESULTS:
: '\97' :: Char
#+BEGIN_SRC haskell
:t '\x61'
#+END_SRC
: '\x61' :: Char

#+BEGIN_SRC haskell
('\97' == 'a') && ('a' == '\x61')
#+END_SRC
: True


****  Fonction sur les caractères
     :PROPERTIES:
     :OPTIONS: num:nil
     :END:

Il existe de nombreuses fonctions sur les caractères, notamment contenue dans la bibliothèque `Data.Char` que l'on peut charger avec
#+BEGIN_SRC haskell
import Data.Char
#+END_SRC
Un exemple 
#+BEGIN_SRC haskell
:t toUpper
#+END_SRC
: toUpper :: Char -> Char

Ce type veut dire que `toUpper` prend en entrée un caractère et renvoie un caractère en résultat.

#+BEGIN_SRC haskell
toUpper 'a'
#+END_SRC

#+RESULTS:
: 'A'

*** String -- chaînes de caractères
Les `String` sont encadrés par des guillemets doubles.  Ce sont des séquences de caractères.
#+BEGIN_SRC haskell
:t "efgh"
#+END_SRC
: "efgh" :: [Char]

*** Int --  entiers à précision fixe
Les `Int` sont des entiers, par exemple -100, 9 ou 0.    Ils sont compris entre $-2^{63}$  et $2^{63}-1$.   En dehors de cet intervalle, les résultats sont chaotiques.
# combien de bytes pour stoquer ses nombres.

#+BEGIN_SRC haskell
2^63 - 1
#+END_SRC
: 9223372036854775807

9 223 372 036 854 775 807 est positif, mais si on lui ajoute 1 et que l'on force le type `Int` on a
#+BEGIN_SRC haskell
2^63 :: Int
#+END_SRC
: -9223372036854775808
un nombre négatif.  On a dépassé la borne $2^63-1$

*** Integer --  entiers sans précision fixée

Les `Integer` sont des entiers aussi grands que ce que permet la mémoire de l'ordinateur.

#+BEGIN_SRC haskell
2^63 :: Integer
#+END_SRC
: 9223372036854775808
Cette fois ci le résultat est positif.
Le désavantage des `Integers` c'est qu'ils sont plus lents à traiter que les `Int`.

*** Float --   nombres à virugle de précision simple
Les `Float` représentent les nombres décimaux, par exemple -12.34, 1.0 ou 3.1415927 (notez le point à la place de la virgule).   Leur taille en mémoire est limité et leur précision dépend de la taille du nombre, par exemple la précision de 
#+BEGIN_SRC haskell
sqrt 2 :: Float
#+END_SRC
: 1.4142135
est de 7 chiffres après la virgule, alors que celle de 

#+BEGIN_SRC haskell
sqrt 9999 :: Float
#+END_SRC
: 99.995
est de 3 chiffre seulement.

`sqrt` est une fonction la librairie /Prelude/ qui calcule la racine carrée un nombre.

*** Double --  nombres à virgule avec deux fois plus de précision
Ce type est similaire à `Float`  mais avec deux fois plus de place en mémoire afin d'accroître la précision.

#+BEGIN_SRC haskell
sqrt 2 :: Double
#+END_SRC
: 1.4142135623730951

Ci-dessus la précision est maintenant de 16 et ci-dessous elle est maintenant de 14.
#+BEGIN_SRC haskell
sqrt 9999 :: Double
#+END_SRC
: 99.99499987499375

Notez qu'il faut toujours faire attention aux problèmes d'arrondis lorsque l'on utilise ces types de nombre pour des calculs précis.


Nous venons de voir qu'il existe plusieurs types de nombre, `Int`, `Integer`, `Float`, et `Double`.    Nous pourront les regrouper dans la classe de type `Num` que nous détaillerons plus tard.

** Types liste

 Une liste est une *séquence* d'éléments de *même type*.   Elle les  encadre avec des crochets et les séparer par des virgules.   On note $[T]$ le type de la liste dont tous les éléments sont de type $T$, par exemple :

#+BEGIN_SRC haskell
:t  [False, True, False ] 
#+END_SRC
: [False, True, False ] :: [Bool]
#+BEGIN_SRC haskell
:t  ['a', 'b', 'c', 'd']
#+END_SRC
: ['a', 'b', 'c', 'd'] :: [Char]

 Un peu plus compliqué
#+BEGIN_SRC haskell
:t "Zéro"
#+END_SRC
: "Zéro" :: [Char]
On remarque qu'une chaîne de caractères est une liste de caractères.

Une liste peut aussi contenir d'autre liste.
#+BEGIN_SRC haskell
:t  ["Un", "Deux", "Trois"]
#+END_SRC
: ["Un", "Deux", "Trois"] :: [[Char]]

Le nombre d'éléments d'une liste s'appelle /length/.  La liste `[]` est  vide, elle a une longueur nulle.   Les listes qui n'ont qu'un seul élément  comme `[False]` ou `['a']` sont appelés /singleton/.

Il n'y a pas de restrictions sur le type d'élément que peut contenir une liste ou sur sa taille.   Cette dernière peut même être infinie.

** Types tuple

 Le tuple est une *séquence* finie d'éléments potentiellement *de type différent*.   On le note entre les parenthèses `()` et ses éléments sont séparés par des virgules.   On écrira $(T_1, T_2, \cdots{}, T_n)$  le type d'un tuple contenant des éléments de type $T_1, T_2 \cdots{} T_n$

#+BEGIN_SRC haskell
:t (False, True)
#+END_SRC
: (False, True) :: (Bool, Bool)

#+BEGIN_SRC haskell
:t ('a', "Bob", True)
#+END_SRC
: ('a', "Bob", True) :: (Char, [Char], Bool)

La longueur d'un tube est appelée /arity/.   Le tuple de longueur zéro `()`  est le tuple vide, mais attention les singletons tuples n'existe pas car leur notation serait confondu avec l'usage mathématique des parenthèses.  Les parenthèses dans `(1+3)*4` doivent être comprise pour leur signification mathématique.  Elles ne désignent pas un tuple.


Évidement, les tuples peuvent contenir d'autres tuples.
#+BEGIN_SRC haskell
:t (False, (True, "Alpha"), [('b','c')])
#+END_SRC

#+RESULTS:
: (False, (True, "Alpha"), [('b','c')])
:   :: (Bool, (Bool, [Char]), [(Char, Char)])

 Il n'y a pas de limite quant au type des éléments contenus dans un tuple, mais leur taille est forcément finie.


** Types fonction
 Une fonction est une relation entre des paramètres d'un certain type et un résultat qui peut-être d'un autre type.   On note $T_1 -> T_2$  le type de toutes les fonctions qui mettent en relation  un paramètre de type $T_1$  avec un résultat de type $T_2$.   Par exemple,
#+BEGIN_SRC haskell
:t not 
#+END_SRC

#+RESULTS:
: not :: Bool -> Bool

#+BEGIN_SRC haskell
:t even
#+END_SRC

#+RESULTS:
: even :: Integral a => a -> Bool

Notez le symbole `=>`.  Il indique une contrainte de classe.   le type `a`  doit appartenir à la classe de type `Integral`.  Cette classe que nous détaillerons plus tard est une classe pour les types numériques pour lesquelles les opérations  `div` et `mod` sont définies.

`even` (est pair) est une fonction qui renvoie `True` si le nombre est pair et `False` sinon.    

*** Fonction avec plusieurs paramètres et résultat
 Si une fonction a plusieurs paramètres, on peut les passer en tant que tuple.  

#+BEGIN_SRC haskell
  ajouter :: (Int, Int) -> Int
  ajouter (x,y) = x+y
#+END_SRC
Par convention, en Haskell, on fait précéder la définition d'une fonction par son type.   Cela sert de documentation et facilite le débogage.

Les résultats peuvent aussi être des listes, par exemple
#+BEGIN_SRC haskell
  zéro_à :: Int -> [Int]
  zéro_à n = [0..n]
#+END_SRC

Notez que les fonctions ne sont pas obligatoirement définies sur tous l'ensemble de leur type (ou domaine).    La fonction `head` définie sur les listes,  ne l'est pas pour la liste vide.
#+BEGIN_SRC haskell
:t head
#+END_SRC

#+RESULTS:
: head :: [a] -> a

#+BEGIN_SRC haskell
head []
#+END_SRC

#+RESULTS:
: *** Exception: Prelude.head: empty list

Nous venons de voir comment définir des fonctions avec plusieurs variables, mais il existe une autre approche qui fait la force de Haskell.  Ce sont les fonctions curryfiées.

