Jour5/manuel.tex

\subsubsection{Char -- caractères}
\label{sec:org65c8a28}
On utilise les guillemets simples pour noter un caractère.
\begin{verbatim}
:t 'a'
\end{verbatim}

On peut aussi utiliser la valeur numérique (décimal ou hexadécimal) telle que définie par \href{https://en.wikipedia.org/wiki/List\_of\_Unicode\_characters\#Latin\_script}{le standard unicode}.   Cela est utile pour saisir des caractères de contrôles, comme '$\backslash{}$n' (nouvelle ligne) ou '$\backslash{}$t' (tabulation).



\begin{verbatim}
:t '\97'
\end{verbatim}
\begin{verbatim}
:t '\x61'
\end{verbatim}
\begin{verbatim}
'\x61' :: Char
\end{verbatim}


\begin{verbatim}
('\97' == 'a') && ('a' == '\x61')
\end{verbatim}
\begin{verbatim}
True
\end{verbatim}


\begin{enumerate}
\item Fonction sur les caractères
\label{sec:org167eccf}
Il existe de nombreuses fonctions sur les caractères, notamment contenue dans la bibliothèque `Data.Char` que l'on peut charger avec
\begin{verbatim}
import Data.Char
\end{verbatim}
Un exemple 
\begin{verbatim}
:t toUpper
\end{verbatim}
\begin{verbatim}
toUpper :: Char -> Char
\end{verbatim}


Ce type veut dire que `toUpper` prend en entrée un caractère et renvoie un caractère en résultat.

\begin{verbatim}
toUpper 'a'
\end{verbatim}
\end{enumerate}

\subsubsection{String -- chaînes de caractères}
\label{sec:org0925caf}
Les `String` sont encadrés par des guillemets doubles.  Ce sont des séquences de caractères.
\begin{verbatim}
:t "efgh"
\end{verbatim}
\begin{verbatim}
"efgh" :: [Char]
\end{verbatim}

\subsubsection{Int --  entiers à précision fixe}
\label{sec:org190f90f}
Les `Int` sont des entiers, par exemple -100, 9 ou 0.    Ils sont compris entre \(-2^{63}\)  et \(2^{63}-1\).   En dehors de cet intervalle, les résultats sont chaotiques.

\begin{verbatim}
2^63 - 1
\end{verbatim}
\begin{verbatim}
9223372036854775807
\end{verbatim}


9 223 372 036 854 775 807 est positif, mais si on lui ajoute 1 et que l'on force le type `Int` on a
\begin{verbatim}
2^63 :: Int
\end{verbatim}
\begin{verbatim}
-9223372036854775808
\end{verbatim}

un nombre négatif.  On a dépassé la borne \(2^63-1\)

\subsubsection{Integer --  entiers sans précision fixée}
\label{sec:org176bbdc}

Les `Integer` sont des entiers aussi grands que ce que permet la mémoire de l'ordinateur.

\begin{verbatim}
2^63 :: Integer
\end{verbatim}
\begin{verbatim}
9223372036854775808
\end{verbatim}

Cette fois ci le résultat est positif.
Le désavantage des `Integers` c'est qu'ils sont plus lents à traiter que les `Int`.

\subsubsection{Float --   nombres à virugle de précision simple}
\label{sec:orgece1399}
Les `Float` représentent les nombres décimaux, par exemple -12.34, 1.0 ou 3.1415927 (notez le point à la place de la virgule).   Leur taille en mémoire est limité et leur précision dépend de la taille du nombre, par exemple la précision de 
\begin{verbatim}
sqrt 2 :: Float
\end{verbatim}
\begin{verbatim}
1.4142135
\end{verbatim}

est de 7 chiffres après la virgule, alors que celle de 

\begin{verbatim}
sqrt 9999 :: Float
\end{verbatim}
\begin{verbatim}
99.995
\end{verbatim}

est de 3 chiffre seulement.

`sqrt` est une fonction la librairie \emph{Prelude} qui calcule la racine carrée un nombre.

\subsubsection{Double --  nombres à virgule avec deux fois plus de précision}
\label{sec:org5bec984}
Ce type est similaire à `Float`  mais avec deux fois plus de place en mémoire afin d'accroître la précision.

\begin{verbatim}
sqrt 2 :: Double
\end{verbatim}
\begin{verbatim}
1.4142135623730951
\end{verbatim}


Ci-dessus la précision est maintenant de 16 et ci-dessous elle est maintenant de 14.
\begin{verbatim}
sqrt 9999 :: Double
\end{verbatim}
\begin{verbatim}
99.99499987499375
\end{verbatim}


Notez qu'il faut toujours faire attention aux problèmes d'arrondis lorsque l'on utilise ces types de nombre pour des calculs précis.


Nous venons de voir qu'il existe plusieurs types de nombre, `Int`, `Integer`, `Float`, et `Double`.    Nous pourront les regrouper dans la classe de type `Num` que nous détaillerons plus tard.

\subsection{Types liste}
\label{sec:org5f2d9e3}

Une liste est une \textbf{séquence} d'éléments de \textbf{même type}.   Elle les  encadre avec des crochets et les séparer par des virgules.   On note \([T]\) le type de la liste dont tous les éléments sont de type \(T\), par exemple :

\begin{verbatim}
:t  [False, True, False ] 
\end{verbatim}
\begin{verbatim}
[False, True, False ] :: [Bool]
\end{verbatim}

\begin{verbatim}
:t  ['a', 'b', 'c', 'd']
\end{verbatim}
\begin{verbatim}
['a', 'b', 'c', 'd'] :: [Char]
\end{verbatim}


Un peu plus compliqué
\begin{verbatim}
:t "Zéro"
\end{verbatim}
\begin{verbatim}
"Zéro" :: [Char]
\end{verbatim}

On remarque qu'une chaîne de caractères est une liste de caractères.

Une liste peut aussi contenir d'autre liste.
\begin{verbatim}
:t  ["Un", "Deux", "Trois"]
\end{verbatim}
\begin{verbatim}
["Un", "Deux", "Trois"] :: [[Char]]
\end{verbatim}


Le nombre d'éléments d'une liste s'appelle \emph{length}.  La liste `[]` est  vide, elle a une longueur nulle.   Les listes qui n'ont qu'un seul élément  comme `[False]` ou `['a']` sont appelés \emph{singleton}.

Il n'y a pas de restrictions sur le type d'élément que peut contenir une liste ou sur sa taille.   Cette dernière peut même être infinie.

\subsection{Types tuple}
\label{sec:orga01bd26}

Le tuple est une \textbf{séquence} finie d'éléments potentiellement \textbf{de type différent}.   On le note entre les parenthèses `()` et ses éléments sont séparés par des virgules.   On écrira \((T_1, T_2, \cdots{}, T_n)\)  le type d'un tuple contenant des éléments de type \(T_1, T_2 \cdots{} T_n\)

\begin{verbatim}
:t (False, True)
\end{verbatim}
\begin{verbatim}
(False, True) :: (Bool, Bool)
\end{verbatim}


\begin{verbatim}
:t ('a', "Bob", True)
\end{verbatim}
\begin{verbatim}
('a', "Bob", True) :: (Char, [Char], Bool)
\end{verbatim}


La longueur d'un tube est appelée \emph{arity}.   Le tuple de longueur zéro `()`  est le tuple vide, mais attention les singletons tuples n'existe pas car leur notation serait confondu avec l'usage mathématique des parenthèses.  Les parenthèses dans `(1+3)*4` doivent être comprise pour leur signification mathématique.  Elles ne désignent pas un tuple.


Évidement, les tuples peuvent contenir d'autres tuples.
\begin{verbatim}
:t (False, (True, "Alpha"), [('b','c')])
\end{verbatim}

Il n'y a pas de limite quant au type des éléments contenus dans un tuple, mais leur taille est forcément finie.


\subsection{Types fonction}
\label{sec:orgc74ee0b}
Une fonction est une relation entre des paramètres d'un certain type et un résultat qui peut-être d'un autre type.   On note \(T_1 -> T_2\)  le type de toutes les fonctions qui mettent en relation  un paramètre de type \(T_1\)  avec un résultat de type \(T_2\).   Par exemple,
\begin{verbatim}
:t not 
\end{verbatim}

\begin{verbatim}
:t even
\end{verbatim}

Notez le symbole `=>`.  Il indique une contrainte de classe.   le type `a`  doit appartenir à la classe de type `Integral`.  Cette classe que nous détaillerons plus tard est une classe pour les types numériques pour lesquelles les opérations  `div` et `mod` sont définies.

`even` (est pair) est une fonction qui renvoie `True` si le nombre est pair et `False` sinon.    

\subsubsection{Fonction avec plusieurs paramètres et résultat}
\label{sec:org70a34fb}
Si une fonction a plusieurs paramètres, on peut les passer en tant que tuple.  

\begin{verbatim}
ajouter :: (Int, Int) -> Int
ajouter (x,y) = x+y
\end{verbatim}
Par convention, en Haskell, on fait précéder la définition d'une fonction par son type.   Cela sert de documentation et facilite le débogage.

Les résultats peuvent aussi être des listes, par exemple
\begin{verbatim}
zéro_à :: Int -> [Int]
zéro_à n = [0..n]
\end{verbatim}

Notez que les fonctions ne sont pas obligatoirement définies sur tous l'ensemble de leur type (ou domaine).    La fonction `head` définie sur les listes,  ne l'est pas pour la liste vide.
\begin{verbatim}
:t head
\end{verbatim}

\begin{verbatim}
head []
\end{verbatim}

Nous venons de voir comment définir des fonctions avec plusieurs variables, mais il existe une autre approche qui fait la force de Haskell.  Ce sont les fonctions curryfiées.
