Jour5/manuel.org
** Fonction curryfiées (/Curried functions/) 
Les fonctions qui prennent leur argument un par un et qui renvoie des fonctions s'appellent fonctions curryfiées ou /curried function/.  En Haskell, une fonction peut renvoyer une fonction comme résultat.

Comparons la fonction `ajouter` curryfiée ci-dessous à celle non currifiée du chapitre précédent.
#+BEGIN_SRC haskell
  ajouter' :: Int -> (Int -> Int)
  ajouter' x y = x+y
#+END_SRC

La fonction `ajouter` curryfiée  prend un paramètre une entrée (un `Int`) et renvoie une fonction qui transforme un `Int` en `Int` (`Int->Int`).   Au chapitre précédent la fonction `ajouter`, non curryfié, qui prenait  2 paramètres en entrée et qui renvoyait un seul `Int` comme résultat.   Toutes les fonctions à plusieurs paramètres peuvent être curryfiées. L'avantage c'est la concision du code et sa lisibilité qui font éviter les bugs..

Voici un autre exemple de fonction curryfiée
#+BEGIN_SRC haskell
  mult :: Int -> (Int -> (Int -> Int))
  mult x y z = x*y*z
#+END_SRC
`mult` renvoie une fonction qui renvoie une fonction qui renvoie un `Int`

#+BEGIN_SRC haskell
mult x y z
#+END_SRC
 veut  dire
#+BEGIN_SRC haskell
((mult x) y) z
#+END_SRC

 Par convention on omettra les parenthèses au niveau des types, ainsi
#+BEGIN_SRC haskell
  mult :: Int -> (Int -> (Int -> Int))
#+END_SRC
 est équivalent à
#+BEGIN_SRC haskell
  mult :: Int -> Int -> Int -> Int
#+END_SRC


** Type Polymorphique
Nous avons  la fonction `head`.  Elle renvoie le premier élément d'une liste quel que soit le type de cet élément.
#+BEGIN_SRC haskell
head [1,2,3,4]
#+END_SRC
: 1

#+BEGIN_SRC haskell
head ["Soumahoro", "Kanté"]
#+END_SRC
: Soumahoro

#+BEGIN_SRC haskell
head "Kirina"
#+END_SRC
: 'K'

C'est donc une fonction qui s'applique à plusieurs types.  Cette spécificité est précisée lorsqu'on regarde son type.
#+BEGIN_SRC haskell
:t head
#+END_SRC
: head :: [a] -> a

Son type fait apparaître une *variable de type* (/type variable/) `a`.  Les variables de type sont notées avec des lettres minuscules par exemple `a`, `b`, ou `c`.

Un type qui fait appel à une variable de type est appelé *type polymorphique*.
*** Exemples de fonctions ayant des types polymorphiques
Regardons le type de certaines fonction courante en Haskell
**** fst

la fonction `fst` qui  extrait le premier élément d'une paire
#+BEGIN_SRC haskell
:t fst
#+END_SRC
: fst :: (a, b) -> a

`fst` a un type qui contient deux variables de type. C'est naturellement un type polymorphique.

#+BEGIN_SRC haskell
fst ("Palmier", 4)
#+END_SRC
: Palmier

**** take
`take` renvois les n premiers éléments d'une liste
: take :: Int -> [a] -> [a]

**** zip
`zip` Rassemble deux listes de type différent en une seule liste de couple
#+RESULTS:
: zip :: [a] -> [b] -> [(a, b)]

**** id
la fonction `id` identité  renvoie le paramètre à l'identique
: id :: a -> a

** Types surchargés,  Overloaded types
  Certaines fonctions s'appliquent à plusieurs types mais avec certaines contraintes. Par exemple la fonction (+)  s'applique `Int` et `Float`  mais pas aux listes.  On note cette contrainte /class constraint/  `C a =>`,   où C est le nom d'une classe de type et `a` une variable de type.   
 #+RESULTS:
 : (+) :: Num a => a -> a -> a

Cela veut dire que la fonction (+) s'applique à des types de la classe Num (ou numérique).

 Un type qui contient les contraintes de classe est appelé un *type surchargé* ou /overloaded type/.

  Voici d'autres exemples
 #+RESULTS:
 : negate :: Num a => a -> a
 : abs ::Num a => a -> a

** Classes de base
 Une /class/ est un ensemble de type pour lesquelles certaines opérations (appelées méthodes) sont définies.

 Voici les classes de base définies par Haskell

*** Eq -- les types égalité
 Cette classe contient les types qui peuvent être comparés  en utilisant les méthodes suivantes

#+RESULTS:
: (==) :: a -> a -> Bool
: (/=) :: a -> a -> Bool

 Tous les types de base, les listes et les tuples, sont des instances de cette classe de type.

*** Ord --  les types  ordonnés
 Cette classe contient tous les types de la classe égalité `Eq` et qui, en plus, supportent les méthodes 6 suivantes:

#+RESULTS:
: (<) :: a -> a -> Bool
: (>) :: a -> a -> Bool
: (<=) :: a -> a -> Bool
: (>=) :: a -> a -> Bool
: min :: a -> a -> a
: max :: a -> a -> a

 Tous les types de base sont des instances de cette classe de type.   Les listes et les tuples, aussi, si les types de leurs éléments  sont instance de cette classe.

#+BEGIN_SRC haskell
('a', 10) < ('a', 100)
#+END_SRC

#+RESULTS:
: True

#+BEGIN_SRC haskell
[1,2,3] > [0,20,4,32]
#+END_SRC

#+RESULTS:
: True

Notez que les listes et tuples sont rangées comme dans un dictionnaire, en comparant l'ordre des éléments  un par un.

#+BEGIN_SRC haskell
('a','b') < ('a', 10)
#+END_SRC

#+RESULTS:
: : error:
:    • No instance for (Num Char) arising from the literal ‘10’
:    • In the expression: 10
:      In the first paramètre of ‘(<)’, namely ‘('a', 10)’
:      In the expression: ('a', 10) < ('a', 'b')

** Show --  les types que l'on peut afficher
 Cette classe contient tous les types dont les valeurs peuvent être converties en chaîne de caractères avec la méthode suivante:

#+RESULTS:
: show :: a -> String

- exemples :
#+BEGIN_SRC haskell
show [1,2,3]
#+END_SRC

#+RESULTS:
: [1,2,3]

#+BEGIN_SRC haskell
show ('a', False)
#+END_SRC

#+RESULTS:
: ('a',False)

** Num --  les types numériques
La classe de type `Num` comprend les `Int`, `Integer`, `Float` et  `Double`.  De façon général, elle comprend  tous les types qui supportent les six méthodes suivantes :
#+RESULTS:
: (+) :: a -> a -> a
: (-) :: a -> a -> a
: (*) :: a -> a -> a
: negate :: a -> a
: abs :: a -> a
: signum :: a -> a

Si l'on regarde le type du nombre 4, par exemple
#+BEGIN_SRC haskell
:t 4
#+END_SRC
: 4 :: Num p => p

On voit qu'il doit être de la catégorie Num.

La fonction `signum` renvoie le signe d'un nombre.
#+BEGIN_SRC haskell
signum (-3)
#+END_SRC
: -1
Notez que les parenthèses sont importantes.  Si on les oublie `signum` essayera de s'appliquer sur le symbole '-'.

** Integral 
 Ce sont les types de la classe Num,  mais qui en plus supporte les deux  méthodes suivantes :
#+RESULTS:
: div :: a -> a -> a
: mod :: a -> a -> a

 Il s'agit la division euclidienne et du modulo.

** Fractional
 Ce sont les types numériques qui, en plus, supportent les 2 méthodes suivantes:
#+RESULTS:
: (/) :: a -> a -> a
: recip :: a -> a

#+BEGIN_SRC haskell
:doc recip
#+END_SRC

#+RESULTS:
:  l'inverse (d'une fraction)

** Exercices

*** Exerice n°1
Quels sont les types des valeurs suivantes ?
#+BEGIN_SRC haskell
['a','b','c']
('a','b','c')
[(False, 'O'), (True,'1')]
([False,True], ['0','1'])
[tail, init, reverse]
#+END_SRC

*** Exercice n°2
 écrire des définitions quelconque mais correct et qui ont les types suivants.
#+BEGIN_SRC haskell
  bools :: [Bool]
  nums :: [[Int]]
  add : Int -> Int -> Int -> Int
  copy :: a -> (a,a)
  apply :: (a->b) -> a -> b
#+END_SRC

*** Exercice n°3
 trouver manuellement les types des fonctions suivantes ?

#+BEGIN_SRC haskell
second xs = head (tail xs)
échange (x,y) = (y,x)
pair x y = (x,y)
double x = x*2
palindrome xs = reverse xs == xs
deuxfois f x = f (fx)
#+END_SRC

 Prenez en compte les éventuelles contraintes de type
 vérifiant suite ce que vous avez trouvé à l'aide GHCi

* Déclaration de fonctions
