Jour5/manuel.tex

\subsection{Fonction curryfiées (\emph{Curried functions})}
\label{sec:orga146d08}
Les fonctions qui prennent leur argument un par un et qui renvoie des fonctions s'appellent fonctions curryfiées ou \emph{curried function}.  En Haskell, une fonction peut renvoyer une fonction comme résultat.

Comparons la fonction `ajouter` curryfiée ci-dessous à celle non currifiée du chapitre précédent.
\begin{verbatim}
ajouter' :: Int -> (Int -> Int)
ajouter' x y = x+y
\end{verbatim}

La fonction `ajouter` curryfiée  prend un paramètre une entrée (un `Int`) et renvoie une fonction qui transforme un `Int` en `Int` (`Int->Int`).   Au chapitre précédent la fonction `ajouter`, non curryfié, qui prenait  2 paramètres en entrée et qui renvoyait un seul `Int` comme résultat.   Toutes les fonctions à plusieurs paramètres peuvent être curryfiées. L'avantage c'est la concision du code et sa lisibilité qui font éviter les bugs..

Voici un autre exemple de fonction curryfiée
\begin{verbatim}
mult :: Int -> (Int -> (Int -> Int))
mult x y z = x*y*z
\end{verbatim}
`mult` renvoie une fonction qui renvoie une fonction qui renvoie un `Int`

\begin{verbatim}
mult x y z
\end{verbatim}
veut  dire
\begin{verbatim}
((mult x) y) z
\end{verbatim}

Par convention on omettra les parenthèses au niveau des types, ainsi
\begin{verbatim}
mult :: Int -> (Int -> (Int -> Int))
\end{verbatim}
est équivalent à
\begin{verbatim}
mult :: Int -> Int -> Int -> Int
\end{verbatim}


\subsection{Type Polymorphique}
\label{sec:org8f82221}
Nous avons  la fonction `head`.  Elle renvoie le premier élément d'une liste quel que soit le type de cet élément.
\begin{verbatim}
head [1,2,3,4]
\end{verbatim}
\begin{verbatim}
1
\end{verbatim}


\begin{verbatim}
head ["Soumahoro", "Kanté"]
\end{verbatim}
\begin{verbatim}
Soumahoro
\end{verbatim}


\begin{verbatim}
head "Kirina"
\end{verbatim}
\begin{verbatim}
'K'
\end{verbatim}


C'est donc une fonction qui s'applique à plusieurs types.  Cette spécificité est précisée lorsqu'on regarde son type.
\begin{verbatim}
:t head
\end{verbatim}
\begin{verbatim}
head :: [a] -> a
\end{verbatim}


Son type fait apparaître une \textbf{variable de type} (\emph{type variable}) `a`.  Les variables de type sont notées avec des lettres minuscules par exemple `a`, `b`, ou `c`.

Un type qui fait appel à une variable de type est appelé \textbf{type polymorphique}.
\subsubsection{Exemples de fonctions ayant des types polymorphiques}
\label{sec:org9d499ea}
Regardons le type de certaines fonction courante en Haskell
\begin{enumerate}
\item fst
\label{sec:org9f30c20}

la fonction `fst` qui  extrait le premier élément d'une paire
\begin{verbatim}
:t fst
\end{verbatim}
\begin{verbatim}
fst :: (a, b) -> a
\end{verbatim}


`fst` a un type qui contient deux variables de type. C'est naturellement un type polymorphique.

\begin{verbatim}
fst ("Palmier", 4)
\end{verbatim}
\begin{verbatim}
Palmier
\end{verbatim}

\item take
\label{sec:org0f01ede}
`take` renvois les n premiers éléments d'une liste
\begin{verbatim}
take :: Int -> [a] -> [a]
\end{verbatim}

\item zip
\label{sec:orge19f3d3}
`zip` Rassemble deux listes de type différent en une seule liste de couple
\begin{verbatim}
zip :: [a] -> [b] -> [(a, b)]
\end{verbatim}

\item id
\label{sec:org17c2c84}
la fonction `id` identité  renvoie le paramètre à l'identique
\begin{verbatim}
id :: a -> a
\end{verbatim}
\end{enumerate}

\subsection{Types surchargés,  Overloaded types}
\label{sec:org7b444d9}
Certaines fonctions s'appliquent à plusieurs types mais avec certaines contraintes. Par exemple la fonction (+)  s'applique `Int` et `Float`  mais pas aux listes.  On note cette contrainte \emph{class constraint}  `C a =>`,   où C est le nom d'une classe de type et `a` une variable de type.   
\begin{verbatim}
(+) :: Num a => a -> a -> a
\end{verbatim}


Cela veut dire que la fonction (+) s'applique à des types de la classe Num (ou numérique).

Un type qui contient les contraintes de classe est appelé un \textbf{type surchargé} ou \emph{overloaded type}.

Voici d'autres exemples
\begin{verbatim}
negate :: Num a => a -> a
abs ::Num a => a -> a
\end{verbatim}

\subsection{Classes de base}
\label{sec:orgc8fa39a}
Une \emph{class} est un ensemble de type pour lesquelles certaines opérations (appelées méthodes) sont définies.

Voici les classes de base définies par Haskell

\subsubsection{Eq -- les types égalité}
\label{sec:org6e9026f}
Cette classe contient les types qui peuvent être comparés  en utilisant les méthodes suivantes

\begin{verbatim}
(==) :: a -> a -> Bool
(/=) :: a -> a -> Bool
\end{verbatim}


Tous les types de base, les listes et les tuples, sont des instances de cette classe de type.

\subsubsection{Ord --  les types  ordonnés}
\label{sec:org62736c3}
Cette classe contient tous les types de la classe égalité `Eq` et qui, en plus, supportent les méthodes 6 suivantes:

\begin{verbatim}
(<) :: a -> a -> Bool
(>) :: a -> a -> Bool
(<=) :: a -> a -> Bool
(>=) :: a -> a -> Bool
min :: a -> a -> a
max :: a -> a -> a
\end{verbatim}


Tous les types de base sont des instances de cette classe de type.   Les listes et les tuples, aussi, si les types de leurs éléments  sont instance de cette classe.

\begin{verbatim}
('a', 10) < ('a', 100)
\end{verbatim}

\begin{verbatim}
[1,2,3] > [0,20,4,32]
\end{verbatim}

Notez que les listes et tuples sont rangées comme dans un dictionnaire, en comparant l'ordre des éléments  un par un.

\begin{verbatim}
('a','b') < ('a', 10)
\end{verbatim}

\subsection{Show --  les types que l'on peut afficher}
\label{sec:orge10a605}
Cette classe contient tous les types dont les valeurs peuvent être converties en chaîne de caractères avec la méthode suivante:

\begin{verbatim}
show :: a -> String
\end{verbatim}


\begin{itemize}
\item exemples :
\end{itemize}
\begin{verbatim}
show [1,2,3]
\end{verbatim}

\begin{verbatim}
show ('a', False)
\end{verbatim}

\subsection{Num --  les types numériques}
\label{sec:orgc9f1c71}
La classe de type `Num` comprend les `Int`, `Integer`, `Float` et  `Double`.  De façon général, elle comprend  tous les types qui supportent les six méthodes suivantes :
\begin{verbatim}
(+) :: a -> a -> a
(-) :: a -> a -> a
(*) :: a -> a -> a
negate :: a -> a
abs :: a -> a
signum :: a -> a
\end{verbatim}


Si l'on regarde le type du nombre 4, par exemple
\begin{verbatim}
:t 4
\end{verbatim}
\begin{verbatim}
4 :: Num p => p
\end{verbatim}


On voit qu'il doit être de la catégorie Num.

La fonction `signum` renvoie le signe d'un nombre.
\begin{verbatim}
signum (-3)
\end{verbatim}
\begin{verbatim}
-1
\end{verbatim}

Notez que les parenthèses sont importantes.  Si on les oublie `signum` essayera de s'appliquer sur le symbole '-'.

\subsection{Integral}
\label{sec:org67efd16}
Ce sont les types de la classe Num,  mais qui en plus supporte les deux  méthodes suivantes :
\begin{verbatim}
div :: a -> a -> a
mod :: a -> a -> a
\end{verbatim}


Il s'agit la division euclidienne et du modulo.

\subsection{Fractional}
\label{sec:orge66f4ed}
Ce sont les types numériques qui, en plus, supportent les 2 méthodes suivantes:
\begin{verbatim}
(/) :: a -> a -> a
recip :: a -> a
\end{verbatim}


\begin{verbatim}
:doc recip
\end{verbatim}

\subsection{Exercices}
\label{sec:org642eba0}

\subsubsection{Exerice n°1}
\label{sec:org3eacd6f}
Quels sont les types des valeurs suivantes ?
\begin{verbatim}
['a','b','c']
('a','b','c')
[(False, 'O'), (True,'1')]
([False,True], ['0','1'])
[tail, init, reverse]
\end{verbatim}

\subsubsection{Exercice n°2}
\label{sec:orga0aef92}
écrire des définitions quelconque mais correct et qui ont les types suivants.
\begin{verbatim}
bools :: [Bool]
nums :: [[Int]]
add : Int -> Int -> Int -> Int
copy :: a -> (a,a)
apply :: (a->b) -> a -> b
\end{verbatim}

\subsubsection{Exercice n°3}
\label{sec:org57305f2}
trouver manuellement les types des fonctions suivantes ?

\begin{verbatim}
second xs = head (tail xs)
échange (x,y) = (y,x)
pair x y = (x,y)
double x = x*2
palindrome xs = reverse xs == xs
deuxfois f x = f (fx)
\end{verbatim}

Prenez en compte les éventuelles contraintes de type
vérifiant suite ce que vous avez trouvé à l'aide GHCi

\section{Déclaration de fonctions}
\label{sec:org62d6462}
