Jour5/manuel.org
** En utilisant les fonctions existantes
 La façon la plus simple de faire des fonctions et d'utiliser  des fonctions qui existent déjà.
 #+BEGIN_SRC haskell
   impair :: Integral a => a -> Bool
   impair n = n `mod` 2 == 0
 #+END_SRC
Ici, on fait appel à l'opérateur `mod`.  On verra ce qu'est un opérateur plus loin.
#+BEGIN_SRC haskell
   séparer :: Int -> [a] -> ([a],[a])
   séparer = n xs = (take n xs, drop n xs)
#+END_SRC

Ici, on fait appelle à `take` et `drop` et ci-dessous simplement à `/`.

#+BEGIN_SRC haskell
   inverse :: Fractional a => a -> a
   inverse n = 1/n
#+END_SRC

** Expressions conditionnelles
#+BEGIN_SRC haskell
  abs' :: Int -> Int
  abs' n = if n >= 0 then n else -n
  
  signum' :: Int -> Int
  signum' n = if n < 0 then 
                  -1
              else
                  if n == 0 then
                      0
                  else
                      1
#+END_SRC

** Gardes
À la place des expressions conditionnelles,  on peut utiliser des équations gardées /guarded equations/.  Un garde c'est un prédicat qui peut être vrai ou faux.   On le note sous forme d'équation ou d'inéquation, juste après un `|`.    Une fonction en utilise généralement plusieurs.
Ils permettent de choisir les instructions à éxecuter. Seule la première des expressions dont le garde est vérifiée est exécutée.  Si un garde est faux, on regarde le deuxième, puis le troisième et ainsi de suite.

#+BEGIN_SRC haskell
  abs'' n | n >= 0 = n
          | otherwise = -n
#+END_SRC
`|`  se lit 'tel que'.  Dans la définition de la fonction `abs` il y a 2 guardes. ` n >= 0` et `otherwise`.  Ce dernier guarde est toujours vrai.

 L'avantage des gardes est qu'ils clarifient le code.

Un autre exemple
#+BEGIN_SRC haskell
  signe n | n < 0 = -1
          | n == 0 = 0
          | otherwise = 1
#+END_SRC

** Motifs (/pattern matching/)

 Beaucoup de fonctions ont des définitions intuitives.  On peut les construite en utilisant une suite de motifs.  
Les motifs sont un peu comme pour les gardes qui permettent de choisir branche de code utiliser, mais ils s'appliquent directement aux arguments.  

Par exemple pour la fonction suivante, en fonction des valeurs des paramètres on affichera soit `True` soit `False`.

#+BEGIN_SRC haskell
et :: Bool -> Bool -> Bool
True `et` True = True
True `et` False = False
False `et` True = False
False `et` False = False
#+END_SRC

Dans cette définition on peut rassembler les trois dernières expressions grâce au joker '_'  qui remplace n'importe quelle valeurs.  La définition de la fonction devient alors:

#+BEGIN_SRC haskell
et :: Bool -> Bool -> Bool
True `et` True = True
_ `et` _ = False
#+END_SRC

*** motifs avec des tuples
 On peut aussi utiliser des tuples dans un motif.  
#+BEGIN_SRC haskell
  premier :: (a,b) -> a
  premier (a,_) = a
#+END_SRC
Ici, on selectionne les tuples de deux éléments et on renvoie le premier de ses éléments, ignorant le second.

*** motifs avec des listes

La même technique s'applique pour les listes.   Un motif de liste, avec une taille donnée, sélectionnera toutes les listes de cette taille.

#+BEGIN_SRC haskell
  test :: [Char] -> Bool 
  test ['a',_,_] = True
  test _ = False
#+END_SRC

La fonction `test` renverra `True` pour toutes les listes d'exactement trois éléments si elles commencent par le caractère 'a'.

Avec les list, on peut aussi utiliser l'opérateur ':' (/cons/).  il permet de construire une liste ou de décomposer les listes.

#+BEGIN_SRC haskell
1 :  [2,3]  == [1,2,3]
#+END_SRC
: True

Il ne faut pas le confondre avec l'opérateur de concaténation '++', qui s'utilise comme suit:
#+BEGIN_SRC haskell
[1] ++ [2,3] == [1,2,3]
#+END_SRC
: True

Voici deux exemples:
*** Entête d'une liste
#+BEGIN_SRC haskell
  entête :: [a] -> a
  entête (x:_) = x 
#+END_SRC

*** Queue d'une liste
#+BEGIN_SRC haskell
  queue :: [a] -> [a]
  queue (_:xs) = xs
#+END_SRC

** Expressions lambda

On peut définir des fonctions sans leur donner de nom.  On appelle ces fonctions /lambda/.  On définie leur paramètre avec la barre oblique `\` et la flèche `->` indique le résultat.

#+BEGIN_SRC haskell
\x -> x + x
#+END_SRC
est la fonction qui prend une variable x et renvoie son double.
On peut l'appeller comme cela :
#+BEGIN_SRC haskell
(\x -> x + x) 3
#+END_SRC
: 6

 Le nombre de variables des fonctions lambda n'est pas limité.

#+BEGIN_SRC haskell
  \x -> (\y -> x + y)
#+END_SRC
est l'écriture lambda de la fonction ajouter qui a deux paramètres

 Ce type de notation est utile pour définir des fonctions à l'intérieur d'autres fonctions.  Par exemple, voici la fonction `impaires` qui génèrent les premiers nombres impairs.     À la place d'écrire
#+BEGIN_SRC haskell
  impaires :: Int -> [Int]
  impaires n = map f [0..n-1]
               where f x = x*2 +1
#+END_SRC
on peut noter
#+BEGIN_SRC haskell
  impaires' :: Int -> [Int]
  impaires' map (\x -> x*2 +1) [0..n-1]
#+END_SRC

La fonction /map/  applique a un ensemble de valeurs, la fonction passé comme son première paramètre.

** Opérateurs
 Un opérateur est une fonction à deux paramètres qui s'écrit entre ses paramètres, par exemple $2 + 3$.   N'importe quelle fonction avec deux paramètres peut être converti en opérateur l'encadrant par des accents graves /back-quotes/, par exemple avec la division entière :
#+BEGIN_SRC haskell
10 `div` 3
#+END_SRC
: 3

On peut aussi curryfier n'importe quel opérateur en  l'encadrant avec des parenthèses, par exemple
#+BEGIN_SRC haskell
(+) 2 3
#+END_SRC
: 5

De façon générale si `#` est un opérateur alors on a :
:  (#)  équivaut \x -> (\y -> x # y)
:  (x #) équivaut \y -> x # y
:  (# y) équivaut \x -> x # y

par exemple 
: (1/) équivaut à  \x -> 1/x
#+BEGIN_SRC haskell
(1/) 4
#+END_SRC
: 0.25

et 
: (/2) équivaut à  \x -> x/2
#+BEGIN_SRC haskell
(/2) 33
#+END_SRC
: 16.5

** Exerices

*** Exercice n°1
 En utilisant les fonctions de la librairie 'Prelude' définit une fonction appelé `moitié` qui prend une liste d'éléments et qui renvoie un tuple contenant les deux moitiés de cette liste.
#+BEGIN_SRC haskell
  moitié :: [a] -> ([a],[a])
#+END_SRC

 La fonction doit renvoyer une erreur si la liste n'a pas un nombre pair d'éléments.

*** Exercice n°2
 Définit, de trois façons différentes, une fonction 'troisième' qui prend une liste d'éléments et qui renvoie le troisième élément de cette liste.
#+BEGIN_SRC haskell
  troisième :: [a] -> a
#+END_SRC

**** En utilisant les fonctions `head` et `tail`

**** en utilisant l'opérateur d'indice '!!'

**** en utilisant la correspondance de motif

*** Exercice n°3
Définir,  de trois façons différentes, la fonction 'boutsécurisé' qui se comporte comme la fonction `tail`  sauf qu'en cas de liste vide, elle renvoie la liste passée en paramètre.   Vous pouvez utiliser la fonction `null` de 'Prelude' pour savoir si la liste est vide
#+BEGIN_SRC haskell
  boutsécurisé :: [a] ->[a]
  null :: [a] -> Bool
#+END_SRC

**** En utilisant des expressions conditionnelles

**** En utilisant des équations gardées

**** En utilisant la correspondance de motif

*** Exercice n°4
définir l'opérateur `(ou)` de la même façon que ce que nous avons fait pour `(et)`

