Jour5/manuel.tex
\subsection{En utilisant les fonctions existantes}
\label{sec:orgb5077cd}
La façon la plus simple de faire des fonctions et d'utiliser  des fonctions qui existent déjà.
\begin{verbatim}
impair :: Integral a => a -> Bool
impair n = n `mod` 2 == 0
\end{verbatim}
Ici, on fait appel à l'opérateur `mod`.  On verra ce qu'est un opérateur plus loin.
\begin{verbatim}
séparer :: Int -> [a] -> ([a],[a])
séparer = n xs = (take n xs, drop n xs)
\end{verbatim}

Ici, on fait appelle à `take` et `drop` et ci-dessous simplement à `/`.

\begin{verbatim}
inverse :: Fractional a => a -> a
inverse n = 1/n
\end{verbatim}

\subsection{Expressions conditionnelles}
\label{sec:org39c540d}
\begin{verbatim}
abs' :: Int -> Int
abs' n = if n >= 0 then n else -n

signum' :: Int -> Int
signum' n = if n < 0 then 
                -1
            else
                if n == 0 then
                    0
                else
                    1
\end{verbatim}

\subsection{Gardes}
\label{sec:orgfa7e38a}
À la place des expressions conditionnelles,  on peut utiliser des équations gardées \emph{guarded equations}.  Un garde c'est un prédicat qui peut être vrai ou faux.   On le note sous forme d'équation ou d'inéquation, juste après un `|`.    Une fonction en utilise généralement plusieurs.
Ils permettent de choisir les instructions à éxecuter. Seule la première des expressions dont le garde est vérifiée est exécutée.  Si un garde est faux, on regarde le deuxième, puis le troisième et ainsi de suite.

\begin{verbatim}
abs'' n | n >= 0 = n
        | otherwise = -n
\end{verbatim}
`|`  se lit 'tel que'.  Dans la définition de la fonction `abs` il y a 2 guardes. ` n >= 0` et `otherwise`.  Ce dernier guarde est toujours vrai.

L'avantage des gardes est qu'ils clarifient le code.

Un autre exemple
\begin{verbatim}
signe n | n < 0 = -1
        | n == 0 = 0
        | otherwise = 1
\end{verbatim}

\subsection{Motifs (\emph{pattern matching})}
\label{sec:org4f87473}

 Beaucoup de fonctions ont des définitions intuitives.  On peut les construite en utilisant une suite de motifs.  
Les motifs sont un peu comme pour les gardes qui permettent de choisir branche de code utiliser, mais ils s'appliquent directement aux arguments.  

Par exemple pour la fonction suivante, en fonction des valeurs des paramètres on affichera soit `True` soit `False`.

\begin{verbatim}
et :: Bool -> Bool -> Bool
True `et` True = True
True `et` False = False
False `et` True = False
False `et` False = False
\end{verbatim}

Dans cette définition on peut rassembler les trois dernières expressions grâce au joker '\_'  qui remplace n'importe quelle valeurs.  La définition de la fonction devient alors:

\begin{verbatim}
et :: Bool -> Bool -> Bool
True `et` True = True
_ `et` _ = False
\end{verbatim}

\subsubsection{motifs avec des tuples}
\label{sec:orged3f54c}
On peut aussi utiliser des tuples dans un motif.  
\begin{verbatim}
premier :: (a,b) -> a
premier (a,_) = a
\end{verbatim}
Ici, on selectionne les tuples de deux éléments et on renvoie le premier de ses éléments, ignorant le second.

\subsubsection{motifs avec des listes}
\label{sec:org3dae041}

La même technique s'applique pour les listes.   Un motif de liste, avec une taille donnée, sélectionnera toutes les listes de cette taille.

\begin{verbatim}
test :: [Char] -> Bool 
test ['a',_,_] = True
test _ = False
\end{verbatim}

La fonction `test` renverra `True` pour toutes les listes d'exactement trois éléments si elles commencent par le caractère 'a'.

Avec les list, on peut aussi utiliser l'opérateur ':' (\emph{cons}).  il permet de construire une liste ou de décomposer les listes.

\begin{verbatim}
1 :  [2,3]  == [1,2,3]
\end{verbatim}
\begin{verbatim}
True
\end{verbatim}


Il ne faut pas le confondre avec l'opérateur de concaténation '++', qui s'utilise comme suit:
\begin{verbatim}
[1] ++ [2,3] == [1,2,3]
\end{verbatim}
\begin{verbatim}
True
\end{verbatim}


Voici deux exemples:
\subsubsection{Entête d'une liste}
\label{sec:org7e51ecf}
\begin{verbatim}
entête :: [a] -> a
entête (x:_) = x 
\end{verbatim}

\subsubsection{Queue d'une liste}
\label{sec:orgca6fef0}
\begin{verbatim}
queue :: [a] -> [a]
queue (_:xs) = xs
\end{verbatim}

\subsection{Expressions lambda}
\label{sec:org1030c4e}

On peut définir des fonctions sans leur donner de nom.  On appelle ces fonctions \emph{lambda}.  On définie leur paramètre avec la barre oblique `$\backslash$` et la flèche `->` indique le résultat.

\begin{verbatim}
\x -> x + x
\end{verbatim}
est la fonction qui prend une variable x et renvoie son double.
On peut l'appeller comme cela :
\begin{verbatim}
(\x -> x + x) 3
\end{verbatim}
\begin{verbatim}
6
\end{verbatim}


Le nombre de variables des fonctions lambda n'est pas limité.

\begin{verbatim}
\x -> (\y -> x + y)
\end{verbatim}
est l'écriture lambda de la fonction ajouter qui a deux paramètres

Ce type de notation est utile pour définir des fonctions à l'intérieur d'autres fonctions.  Par exemple, voici la fonction `impaires` qui génèrent les premiers nombres impairs.     À la place d'écrire
\begin{verbatim}
impaires :: Int -> [Int]
impaires n = map f [0..n-1]
             where f x = x*2 +1
\end{verbatim}
on peut noter
\begin{verbatim}
impaires' :: Int -> [Int]
impaires' map (\x -> x*2 +1) [0..n-1]
\end{verbatim}

La fonction \emph{map}  applique a un ensemble de valeurs, la fonction passé comme son première paramètre.

\subsection{Opérateurs}
\label{sec:org7bae8fa}
Un opérateur est une fonction à deux paramètres qui s'écrit entre ses paramètres, par exemple \(2 + 3\).   N'importe quelle fonction avec deux paramètres peut être converti en opérateur l'encadrant par des accents graves \emph{back-quotes}, par exemple avec la division entière :
\begin{verbatim}
10 `div` 3
\end{verbatim}
\begin{verbatim}
3
\end{verbatim}


On peut aussi curryfier n'importe quel opérateur en  l'encadrant avec des parenthèses, par exemple
\begin{verbatim}
(+) 2 3
\end{verbatim}
\begin{verbatim}
5
\end{verbatim}


De façon générale si `\#` est un opérateur alors on a :
\begin{verbatim}
(#)  équivaut \x -> (\y -> x # y)
(x #) équivaut \y -> x # y
(# y) équivaut \x -> x # y
\end{verbatim}


par exemple 
\begin{verbatim}
(1/) équivaut à  \x -> 1/x
\end{verbatim}

\begin{verbatim}
(1/) 4
\end{verbatim}
\begin{verbatim}
0.25
\end{verbatim}


et 
\begin{verbatim}
(/2) équivaut à  \x -> x/2
\end{verbatim}

\begin{verbatim}
(/2) 33
\end{verbatim}
\begin{verbatim}
16.5
\end{verbatim}

\subsection{Exerices}
\label{sec:orgd34a7f8}

\subsubsection{Exercice n°1}
\label{sec:orgd427cfa}
En utilisant les fonctions de la librairie 'Prelude' définit une fonction appelé `moitié` qui prend une liste d'éléments et qui renvoie un tuple contenant les deux moitiés de cette liste.
\begin{verbatim}
moitié :: [a] -> ([a],[a])
\end{verbatim}

La fonction doit renvoyer une erreur si la liste n'a pas un nombre pair d'éléments.

\subsubsection{Exercice n°2}
\label{sec:orgc6435ab}
Définit, de trois façons différentes, une fonction 'troisième' qui prend une liste d'éléments et qui renvoie le troisième élément de cette liste.
\begin{verbatim}
troisième :: [a] -> a
\end{verbatim}

\begin{enumerate}
\item En utilisant les fonctions `head` et `tail`
\label{sec:org4ce89ea}

\item en utilisant l'opérateur d'indice '!!'
\label{sec:orgdf1dbd8}

\item en utilisant la correspondance de motif
\label{sec:orgb813d1c}
\end{enumerate}

\subsubsection{Exercice n°3}
\label{sec:orgde7dee9}
Définir,  de trois façons différentes, la fonction 'boutsécurisé' qui se comporte comme la fonction `tail`  sauf qu'en cas de liste vide, elle renvoie la liste passée en paramètre.   Vous pouvez utiliser la fonction `null` de 'Prelude' pour savoir si la liste est vide
\begin{verbatim}
boutsécurisé :: [a] ->[a]
null :: [a] -> Bool
\end{verbatim}

\begin{enumerate}
\item En utilisant des expressions conditionnelles
\label{sec:orgef01bf4}

\item En utilisant des équations gardées
\label{sec:orgf45df81}

\item En utilisant la correspondance de motif
\label{sec:orgbb495d0}
\end{enumerate}

\subsubsection{Exercice n°4}
\label{sec:org6e50572}
définir l'opérateur `(ou)` de la même façon que ce que nous avons fait pour `(et)`
