Jour5/manuel.org
* Listes en compréhension
Une liste en compréhension est une liste définie en utilisant les éléments d'une autre liste.  En mathématiques, la liste des carrés des 5 premiers entiers notée en compréhension s'écrit $$\{x^2 | x \in [1\cdots{} 5]\}$$.

En Haskell on note
#+BEGIN_SRC haskell
  [x^2 | x <- [1..5 ]]
#+END_SRC
: [1,4,9,16,25]

On appelle la liste utilisé un /générateur/.  On peut en utiliser plusieurs, par exemple
#+BEGIN_SRC haskell
  [(x,y) | x <- [1,2,3],  y <- "aB"]
#+END_SRC
: [(1,'a'),(1,'B'),(1,'c'),(1,'d'),(2,'a'),(2,'B'),(2,'c'),(2,'d'),(3,'a'),(3,'B'),(3,'c'),(3,'d')]
génère la liste des couples dont le premier élément est 1, 2 ou 3 et le deuxième 'a' ou 'B'.

L'ordre des générateurs est important.
#+BEGIN_SRC haskell
  [(x,y) | y <- "aB", x <- [1,2,3]]
#+END_SRC
: [(1,'a'),(2,'a'),(3,'a'),(1,'B'),(2,'B'),(3,'B')]

C'est le second qui change plus vite.

** Filtres /Guards/
Dans les listes en  compréhension on peut utiliser des filtres (ou /guards/) pour limiter les valeurs du générateurs à prendre en compte.
Les guardes viennent après le symbole ',', par exemple :

   #+BEGIN_SRC haskell
     diviseurs_de :: Int -> [Int]
     diviseurs_de n = [x | x <- [1..n], n `mod` x == 0]
   #+END_SRC

** la fonction zip
La fonction `zip` est souvent utilisé avec les listes en compréhension.  C'est une fonction qui crée une liste de paires en prenant deux  éléments dans deux listes différentes, jusqu'à épuisement de l'une d'elles.

#+BEGIN_SRC haskell
zip "abcd" [1..10]
#+END_SRC
: [('a',1),('b',2),('c',3),('d',4)]

On peut s'en servire pour créer des paires, à partir d'une même liste.
#+BEGIN_SRC haskell
paires :: [a] -> [(a,a)]
paires xs = zip xs (tail xs)
#+END_SRC
Ce qui donne
#+BEGIN_SRC haskell
paires [1..5]
#+END_SRC
: [(1,2),(2,3),(3,4),(4,5)]

On peut ainsi définir une fonction qui vérifie si une liste et triée.
#+BEGIN_SRC haskell
  est_triée :: Ord a => [a] -> Bool 
  est_triée xs = and [x <= y | (x,y)  <- paires xs]
#+END_SRC
Vérifions avec
#+BEGIN_SRC haskell
est_triée [1,2,3,10,5]
#+END_SRC
: False

** Exercices
*** Exercice n°1
En utilisant une liste en compréhension donner l'expression qui calcule la somme des carrés des cent premiers entiers.
$1^2+2^2+\cdots{}+100^2$

*** Exercice n°2
 Soi un système de coordonnées sur une grille de taille $m\times n$  définie par  un couple $(x,y)$ avec $0\leq x \leq m$ et $0 \leq y \leq n$.
 En utilisant les fonctions standard définir la fonction 'grille'  qui renvoie les coordonnées de tous les points d'une crise dont les dimensions sont passées en paramètre.
#+BEGIN_SRC haskell
grille :: Int -> Int -> [(Int,Int)]
#+END_SRC
#+BEGIN_SRC bash  -i
> grille 1 2
#+END_SRC
: [(0,0),(0,1),(0,2),(1,0),(1,1),(1,2)]

*** Exercice n°3
 Définir une fonction `réplique` qui prend en paramètre un entier $n$ et une valeur et qui renvoie une liste où la valeur est répliquée $n$ fois.

#+BEGIN_SRC haskell
réplique :: Int -> a -> [a]
#+END_SRC

#+BEGIN_SRC bash  -i
> réplique 3 True
#+END_SRC
: [True, True, True]

* Fonctions récursives

** Concepts de bases
 Une fonction récursive et une fonction qui s'appelle elle-même. On peut définir la fonction `factorielle` récursivement.
#+BEGIN_SRC haskell
  factorielle :: Int -> Int
  factorielle 0 = 1
  factorielle x = x * factorielle (x - 1)
#+END_SRC
Ce n'est pas la façon la plus rapide à calculer mais cela est très lisible.

** Récursion et listes
 Voici d'autres exemples de fonctions récursive avec des listes en paramètre:

*** Produit
    #+BEGIN_SRC haskell
      produit :: Num a => [a] -> a
      produit [] = 0
      produit (n:ns) = n * produit ns
    #+END_SRC

*** Longueur
 #+BEGIN_SRC haskell
   longueur :: [a] -> Int
   longueur [] = 0
   longueur (_:xs) = 1 + longueur xs
 #+END_SRC
*** Renverse
 #+BEGIN_SRC haskell
   renverse :: [a] -> [a]
   renverse [] = []
   renverse (x:xs) = reverse xs ++ [x] 
 #+END_SRC

*** Coupler
Les fonctions récursives peuvent aussi avoir plusieurs paramètres.

La fonction `coupler` fait comme le `zip` et on la définie comme suit:
#+BEGIN_SRC haskell
  coupler :: [a] -> [b] -> [(a,v)]
  coupler [] _ = []
  coupler _ [] = []
  coupler (x:xs) (y:ys) = (x,y) : coupler xs ys
#+END_SRC
*** Décapiter
La fonction `décapiter` qui supprime les n premiers éléments d'une liste.
#+BEGIN_SRC haskell
  décapiter :: Int -> [a] -> [a]
  décapiter 0 xs = xs
  décapiter _ [] = []
  décapiter n (_:xs) = décapiter (n-1) xs
#+END_SRC

** Récursions multiples

 Une fonction récursive peut s'appeler elle-même plusieurs fois,  par exemple, ici,  pour construire la suite de fibonacci : 
#+BEGIN_SRC haskell
  fibo :: Int -> Int
  fibo 0 = 0
  fibo 1 = 1
  fibo n = fibo (n-2) + fibo (n-1)
#+END_SRC
et ici pour définir un algorithme de tri_rapide
#+BEGIN_SRC haskell
    tri_rapide :: Ord a => [a] -> [a]
    tri_rapide [] = []
    tri_rapide (x:xs) = tri_rapide plus_petits ++ [x] ++ tri_rapide plus_grands
                        where 
                          plus_petits = [a | a <- xs, a <= xs]
                          plus_grands = [b | b <- xs, b > xs]
#+END_SRC

** Récursion mutelle
Les fonctions récursives en Haskell peuvent aussi faire appellent à des fonctions qui les rappellent.  Par exemple `est_pair` à besoin de `est_impair` 
#+BEGIN_SRC haskell
  est_pair :: Int -> Bool 
  est_pair 0 = True
  est_pair n = est_impair (n-1)
#+END_SRC
  qui a besoin de `est_pair`.
#+BEGIN_SRC haskell
  est_impair :: Int -> Bool
  est_impair 1 = True
  est_impair n = est_pair (n-1)
#+END_SRC
Ou encore la fonction `indices_pairs` qui selection un élément s sur deux dans une liste en partant du premier, à besoin des `indices_impairs`
#+BEGIN_SRC haskell
  indices_pairs :: [a] -> [a]
  indices_pairs [] = []
  indices_pairs (x:xs) = x : indices_impairs xs
#+END_SRC

qui a besoin de `indice_pairs`.
#+BEGIN_SRC haskell
  indices_impairs :: [a] -> [a]
  indices_impairs [] = []
  indices_impairs (_:xs) = indices_pairs xs
#+END_SRC
** Conseils pour construire des fonctions récursives.
La récursion,  c'est comme le vélo.  Cela semble simple lorsque l'on voit quelqu'un d'autre en faire mais il faut de la pratique pour bien y arriver.

Voici une démarche à suivre et quelques conseils pour y arrriver.
*** Définir le type de la fonction
#+BEGIN_SRC haskell
  produit :: [Int] -> Int
#+END_SRC
*** Identifier les cas importants
#+BEGIN_SRC haskell
produit [] = 
produit (n:ns) = 
#+END_SRC
*** Écrire la définition de cas simples
#+BEGIN_SRC haskell
produit [] = 1
produit (n:ns) = 
#+END_SRC

*** Écrire la définition des autres cas
#+BEGIN_SRC haskell
produit [] = 1
produit (n:ns) = n * produit ns
#+END_SRC

*** Généraliser et simplifier
Dans notre exemple la fonction `produit` peut s'appliquer à tous les types de la classe `Num`.
#+BEGIN_SRC haskell
  produit :: Num a => [a] -> a
#+END_SRC

 On va voir dans le prochain chapitre que la manière dont nous venons de définir la fonction `produit`  est très générique et Haskell permet de coder une multitude de fonction de cette manière à l'aide de la fonction /foldr/.   

`produit` se  définit alors en une ligne.
#+BEGIN_SRC haskell
produit = foldr (*) 1
#+END_SRC

** Exerices

*** Exercices n°1
Définir une fonction récurcive 'euclide' qui calcule le plus grand diviseur de deux nombres non-négatifs.  
#+BEGIN_SRC haskell
  euclide :: Int -> Int -> Int
#+END_SRC
Si les deux nombre sont égaux, alors ce nombre est le résultat, sinon le plus petit est soustrait au plus grand.

