Jour5/manuel.tex

\section{Listes en compréhension}
\label{sec:org3ebd5dd}
Une liste en compréhension est une liste définie en utilisant les éléments d'une autre liste.  En mathématiques, la liste des carrés des 5 premiers entiers notée en compréhension s'écrit $$\{x^2 | x \in [1\cdots{} 5]\}$$.

En Haskell on note
\begin{verbatim}
[x^2 | x <- [1..5 ]]
\end{verbatim}
\begin{verbatim}
[1,4,9,16,25]
\end{verbatim}


On appelle la liste utilisé un \emph{générateur}.  On peut en utiliser plusieurs, par exemple
\begin{verbatim}
[(x,y) | x <- [1,2,3],  y <- "aB"]
\end{verbatim}
\begin{verbatim}
[(1,'a'),(1,'B'),(1,'c'),(1,'d'),(2,'a'),(2,'B'),(2,'c'),(2,'d'),(3,'a'),(3,'B'),(3,'c'),(3,'d')]
\end{verbatim}

génère la liste des couples dont le premier élément est 1, 2 ou 3 et le deuxième 'a' ou 'B'.

L'ordre des générateurs est important.
\begin{verbatim}
[(x,y) | y <- "aB", x <- [1,2,3]]
\end{verbatim}
\begin{verbatim}
[(1,'a'),(2,'a'),(3,'a'),(1,'B'),(2,'B'),(3,'B')]
\end{verbatim}


C'est le second qui change plus vite.

\subsection{Filtres \emph{Guards}}
\label{sec:orga6bfb78}
Dans les listes en  compréhension on peut utiliser des filtres (ou \emph{guards}) pour limiter les valeurs du générateurs à prendre en compte.
Les guardes viennent après le symbole ',', par exemple :

\begin{verbatim}
diviseurs_de :: Int -> [Int]
diviseurs_de n = [x | x <- [1..n], n `mod` x == 0]
\end{verbatim}

\subsection{la fonction zip}
\label{sec:orgb86586a}
La fonction `zip` est souvent utilisé avec les listes en compréhension.  C'est une fonction qui crée une liste de paires en prenant deux  éléments dans deux listes différentes, jusqu'à épuisement de l'une d'elles.

\begin{verbatim}
zip "abcd" [1..10]
\end{verbatim}
\begin{verbatim}
[('a',1),('b',2),('c',3),('d',4)]
\end{verbatim}


On peut s'en servire pour créer des paires, à partir d'une même liste.
\begin{verbatim}
paires :: [a] -> [(a,a)]
paires xs = zip xs (tail xs)
\end{verbatim}
Ce qui donne
\begin{verbatim}
paires [1..5]
\end{verbatim}
\begin{verbatim}
[(1,2),(2,3),(3,4),(4,5)]
\end{verbatim}


On peut ainsi définir une fonction qui vérifie si une liste et triée.
\begin{verbatim}
est_triée :: Ord a => [a] -> Bool 
est_triée xs = and [x <= y | (x,y)  <- paires xs]
\end{verbatim}
Vérifions avec
\begin{verbatim}
est_triée [1,2,3,10,5]
\end{verbatim}
\begin{verbatim}
False
\end{verbatim}

\subsection{Exercices}
\label{sec:org1d611d4}
\subsubsection{Exercice n°1}
\label{sec:org5387fce}
En utilisant une liste en compréhension donner l'expression qui calcule la somme des carrés des cent premiers entiers.
\(1^2+2^2+\cdots{}+100^2\)

\subsubsection{Exercice n°2}
\label{sec:orgb7b6f96}
Soi un système de coordonnées sur une grille de taille \(m\times n\)  définie par  un couple \((x,y)\) avec \(0\leq x \leq m\) et \(0 \leq y \leq n\).
En utilisant les fonctions standard définir la fonction 'grille'  qui renvoie les coordonnées de tous les points d'une crise dont les dimensions sont passées en paramètre.
\begin{verbatim}
grille :: Int -> Int -> [(Int,Int)]
\end{verbatim}
\begin{verbatim}
> grille 1 2
\end{verbatim}
\begin{verbatim}
[(0,0),(0,1),(0,2),(1,0),(1,1),(1,2)]
\end{verbatim}

\subsubsection{Exercice n°3}
\label{sec:orgf2875cd}
Définir une fonction `réplique` qui prend en paramètre un entier \(n\) et une valeur et qui renvoie une liste où la valeur est répliquée \(n\) fois.

\begin{verbatim}
réplique :: Int -> a -> [a]
\end{verbatim}

\begin{verbatim}
> réplique 3 True
\end{verbatim}
\begin{verbatim}
[True, True, True]
\end{verbatim}

\section{Fonctions récursives}
\label{sec:orgeaa4277}

\subsection{Concepts de bases}
\label{sec:org2d651f4}
Une fonction récursive et une fonction qui s'appelle elle-même. On peut définir la fonction `factorielle` récursivement.
\begin{verbatim}
factorielle :: Int -> Int
factorielle 0 = 1
factorielle x = x * factorielle (x - 1)
\end{verbatim}
Ce n'est pas la façon la plus rapide à calculer mais cela est très lisible.

\subsection{Récursion et listes}
\label{sec:org3f64e04}
Voici d'autres exemples de fonctions récursive avec des listes en paramètre:

\subsubsection{Produit}
\label{sec:orgc4d516a}
\begin{verbatim}
produit :: Num a => [a] -> a
produit [] = 0
produit (n:ns) = n * produit ns
\end{verbatim}

\subsubsection{Longueur}
\label{sec:org74120ec}
\begin{verbatim}
longueur :: [a] -> Int
longueur [] = 0
longueur (_:xs) = 1 + longueur xs
\end{verbatim}
\subsubsection{Renverse}
\label{sec:orgb9a5e17}
\begin{verbatim}
renverse :: [a] -> [a]
renverse [] = []
renverse (x:xs) = reverse xs ++ [x] 
\end{verbatim}

\subsubsection{Coupler}
\label{sec:orge3e4c53}
Les fonctions récursives peuvent aussi avoir plusieurs paramètres.

La fonction `coupler` fait comme le `zip` et on la définie comme suit:
\begin{verbatim}
coupler :: [a] -> [b] -> [(a,v)]
coupler [] _ = []
coupler _ [] = []
coupler (x:xs) (y:ys) = (x,y) : coupler xs ys
\end{verbatim}
\subsubsection{Décapiter}
\label{sec:orgf2456db}
La fonction `décapiter` qui supprime les n premiers éléments d'une liste.
\begin{verbatim}
décapiter :: Int -> [a] -> [a]
décapiter 0 xs = xs
décapiter _ [] = []
décapiter n (_:xs) = décapiter (n-1) xs
\end{verbatim}

\subsection{Récursions multiples}
\label{sec:org98f376c}

Une fonction récursive peut s'appeler elle-même plusieurs fois,  par exemple, ici,  pour construire la suite de fibonacci : 
\begin{verbatim}
fibo :: Int -> Int
fibo 0 = 0
fibo 1 = 1
fibo n = fibo (n-2) + fibo (n-1)
\end{verbatim}
et ici pour définir un algorithme de tri\_rapide
\begin{verbatim}
tri_rapide :: Ord a => [a] -> [a]
tri_rapide [] = []
tri_rapide (x:xs) = tri_rapide plus_petits ++ [x] ++ tri_rapide plus_grands
                    where 
                      plus_petits = [a | a <- xs, a <= xs]
                      plus_grands = [b | b <- xs, b > xs]
\end{verbatim}

\subsection{Récursion mutelle}
\label{sec:org1f927db}
Les fonctions récursives en Haskell peuvent aussi faire appellent à des fonctions qui les rappellent.  Par exemple `est\_pair` à besoin de `est\_impair` 
\begin{verbatim}
est_pair :: Int -> Bool 
est_pair 0 = True
est_pair n = est_impair (n-1)
\end{verbatim}
qui a besoin de `est\_pair`.
\begin{verbatim}
est_impair :: Int -> Bool
est_impair 1 = True
est_impair n = est_pair (n-1)
\end{verbatim}
Ou encore la fonction `indices\_pairs` qui selection un élément s sur deux dans une liste en partant du premier, à besoin des `indices\_impairs`
\begin{verbatim}
indices_pairs :: [a] -> [a]
indices_pairs [] = []
indices_pairs (x:xs) = x : indices_impairs xs
\end{verbatim}

qui a besoin de `indice\_pairs`.
\begin{verbatim}
indices_impairs :: [a] -> [a]
indices_impairs [] = []
indices_impairs (_:xs) = indices_pairs xs
\end{verbatim}
\subsection{Conseils pour construire des fonctions récursives.}
\label{sec:orgedb593a}
La récursion,  c'est comme le vélo.  Cela semble simple lorsque l'on voit quelqu'un d'autre en faire mais il faut de la pratique pour bien y arriver.

Voici une démarche à suivre et quelques conseils pour y arrriver.
\subsubsection{Définir le type de la fonction}
\label{sec:org768e998}
\begin{verbatim}
produit :: [Int] -> Int
\end{verbatim}
\subsubsection{Identifier les cas importants}
\label{sec:org93affef}
\begin{verbatim}
produit [] = 
produit (n:ns) = 
\end{verbatim}
\subsubsection{Écrire la définition de cas simples}
\label{sec:org31969e9}
\begin{verbatim}
produit [] = 1
produit (n:ns) = 
\end{verbatim}

\subsubsection{Écrire la définition des autres cas}
\label{sec:orgf496aca}
\begin{verbatim}
produit [] = 1
produit (n:ns) = n * produit ns
\end{verbatim}

\subsubsection{Généraliser et simplifier}
\label{sec:org8ba95f1}
Dans notre exemple la fonction `produit` peut s'appliquer à tous les types de la classe `Num`.
\begin{verbatim}
produit :: Num a => [a] -> a
\end{verbatim}

On va voir dans le prochain chapitre que la manière dont nous venons de définir la fonction `produit`  est très générique et Haskell permet de coder une multitude de fonction de cette manière à l'aide de la fonction \emph{foldr}.   

`produit` se  définit alors en une ligne.
\begin{verbatim}
produit = foldr (*) 1
\end{verbatim}

\subsection{Exerices}
\label{sec:orge8137ad}

\subsubsection{Exercices n°1}
\label{sec:orgea4d1db}
Définir une fonction récurcive 'euclide' qui calcule le plus grand diviseur de deux nombres non-négatifs.  
\begin{verbatim}
euclide :: Int -> Int -> Int
\end{verbatim}
Si les deux nombre sont égaux, alors ce nombre est le résultat, sinon le plus petit est soustrait au plus grand.
