Jour5/manuel.org
*** Exercice n°2
Définir de façon récursive les fonctions suivantes:

**** `et_liste`  
#+BEGIN_SRC haskell
  et_liste :: [Bool] -> Bool 
#+END_SRC
décide si tout les valeurs de la liste sont vraie

**** 'concatène'
#+BEGIN_SRC haskell
  concatène :: [[a]] -> [a]
#+END_SRC
Concatène une liste de listes

**** 'est_élément'
#+BEGIN_SRC haskell
  est_élément :: Eq a => a -> [a] -> Bool 
#+END_SRC
Décide si un élément fait partie d'une liste.

*** Exercice n°3
Définie une fonction récursive `fusionne`  qui rassemble deux listes en une seule triée.
#+BEGIN_SRC haskell
  fusionne :: Ord a => [a] -> [a] -> [a]
#+END_SRC
par exemple
#+BEGIN_SRC bash  -i
>merge [2,5,6] [1,3,4]
#+END_SRC
: [1,2,3,4,5,6]

* Fonctions de haut-niveau (higher-order)
Une fonction de haut-niveau est une fonction qui *prend d'autre(s) fonction(s) en paramètre*.

** Exemples de base
Les fonctions de ce types les plus courantes sont `map` et `filter`. 
`map`  applique la fonction passé en paramètre sur une liste d'éléments.
#+BEGIN_SRC haskell
  map (\x -> x^2) [1..5]
#+END_SRC
: [1,4,9,16,25]

`filter` renvoie une liste d'élément sélectionné dans une autre liste selon un prédicat passé sous forme de fonction en paramètre, par exemple:

#+BEGIN_SRC haskell
filter (\[x,y] -> x == y)  [ "aa", "ab", "Aa", "AA"] 
#+END_SRC
: ["aa","AA"]

 Nous donnons maintenant des exemples courants de fonctions de haut-niveau.
** fold
- `foldr`  applique un opérateur sur une liste en allant de la droite à la gauche.  Elle est souvent appelée /reduce/ dans d'autre langage.
#+BEGIN_SRC haskell
  longueur :: [a] -> Int
  longueur = flodr (\_ n -> 1 +n) 0
#+END_SRC

- `foldl`:  applique un opérateur sur une liste en allant de la droite à la gauche.
** Composition
L'opérateur `(.)` permet de faire de la composition de fonction.  Cela simplifie et de clarifie le code.   À la place de noter 
#+BEGIN_SRC haskell
impaire n = not (paire n)
#+END_SRC
on note
#+BEGIN_SRC haskell
impaire  = not . pair
#+END_SRC
À la place de 
#+BEGIN_SRC haskell
repéter f x = f (f x)
#+END_SRC
on écrit
#+BEGIN_SRC haskell
répeter = f . f
#+END_SRC
et à la place de 
#+BEGIN_SRC haskell
somme_carré_positif ns = sum (map (^2) (filter paire ns))
#+END_SRC
on écrira
#+BEGIN_SRC haskell
somme_carré_positif = sum . map (^2) . filter pair
#+END_SRC

** Exercices

*** Exercice n°1
Redéfinir la liste en compréhension $[f x | x <- xs, p x]$ en utilisant les fonctions de haut niveau `map` et `filter`
**** solution
#+BEGIN_SRC haskell
-- [f x | x <- xs, p x] ?
exo1 :: (a -> b) -> [a] -> (a -> Bool) -> [b]
exo1 f xs p = [f x | x <- xs, p x]

exo1sol :: (a -> b) -> [a] -> (a -> Bool) -> [b]
exo1sol f xs p = map f (filter p xs)
-- map f filter p xs
#+END_SRC

*** Exercice n°2
Redéfinir les fonctions `map f` et `filter p` en utilisant `foldr`

**** solution

#+BEGIN_SRC haskell
-- exo3 redefine map f and filter p using foldr

map_ :: (a -> b) -> [a] -> [b]
map_ f xs = foldr apply_f [] xs
  where apply_f x y = (f x : y)

map__ :: (a -> b) -> [a] -> [b]
map__ f xs = foldr (\x y -> f x : y) [] xs


filter_ :: (a -> Bool) -> [a] -> [a]
filter_ p xs = foldr filter_p [] xs
  where filter_p x y
          | p x = (x:y)
          | otherwise = y
#+END_SRC

*** Exercice n°3
En utilisant `foldl` définr la fonction dec2Int
qui converti une liste de nombre en entier
#+BEGIN_SRC haskell
  dec2Int :: [Int] -> Int
#+END_SRC

#+BEGIN_SRC bash  -i
dec2int [2,3,4,5]
#+END_SRC
: 2345

**** sol
#+BEGIN_SRC haskell
-- exo 4 p. 105
-- Using foldl, deﬁne a function dec2int :: [Int] -> Int that converts a
-- decimal number into an integer. For example:

dec2int :: [Int] -> Int
dec2int xs = foldl (\x y -> 10 * x + y) 0 xs

#+END_SRC
* Déclaration des Types et des Classes
Les noms de types de classe *commencent avec une majuscule*.

** Comment déclarer de nouveau type
*** types
 On peut les définir en utilisant des types existants
 #+BEGIN_SRC haskell
   type Position = (Int, Int)
   type Transistion = Pos -> Pos
 #+END_SRC

 Les types récursifs sont interdits.
 #+BEGIN_SRC haskell
   type Arbre = (Int, [Tree]) --interdit
 #+END_SRC

 Par contre, on peut utiliser les classes de type
 #+BEGIN_SRC haskell
 type Paire a = (a,a)
 type Dico k v = [(k,v)]
 #+END_SRC
*** data
 `data` permet de créer un nouveau type en énumérant les différentes valeurs possibles.

 #+BEGIN_SRC haskell
   data Déplacement = Nord | Sud | Est | Ouest deriving Show
  
   déplace :: Déplacement -> Position -> Position
   déplace North (x,y) = (x,y+1)
   déplace Sud (x,y) = (x, y-1)
   déplace Est (x,y) = (x+1,y)
   déplace Ouest (x,y) = (x-1,y)
 #+END_SRC
 `data` permet d'utiliser des variables et des paramètres.  Par exemple :
 #+BEGIN_SRC haskell
   data Forme = Cercle Float | Rectangle Float Float
  
   faire_carré :: Float -> Forme
   faire_carré n = Rectangle n n
  
   faire_cercle :: Float -> Forme
   faire_cercle r = Cercle r
  
   calculer_aire :: Forme -> Float
   calculer_aire (Rectangle long larg) = long * larg
   calculer_aire (Cercle r) = pi * r^2
 #+END_SRC
 Ci-dessus, les constructeurs `Cercle` et `Rectangle` sont des fonctions constructeurs, à cause de leurs variables.  On le voit en demandant le type de `Cercle`.
 #+BEGIN_SRC haskell
 :t Cercle
 #+END_SRC
 : Cercle :: Float -> Forme

 - un autre exemple de type avec une variable
 #+BEGIN_SRC haskell
   data Maybe a = Nothing | Just a
  
   division_securisée :: Int -> Int -> Maybe Int
   division_securisée _ 0 :: Nothing
   division_securisée m n = Just (m `div` n)
 #+END_SRC

*** newtype
 La troisième façon de créer un type est en utilisant le mot clef `newtype`.
 #+BEGIN_SRC haskell
 newtype Entier_Naturel = N Int
 #+END_SRC

*** types récursifs
 Dans certains cas les définitions des types peuvent être récursives, par exemple
 #+BEGIN_SRC haskell
 data Naturel = Zero | Succ Naturel deriving Show
 data Arbre a = Feuille a | Noeud (Arbre a) a (Arbre a) deriving Show
 #+END_SRC

** Classes de type
Les classes de types ne sont possible que pour les types déclarés avec `data` et `newtype`.

Voici comment on déclare un classe de type en Haskell
#+BEGIN_SRC haskell
  class Eq a where 
      (==), (/=) :: a -> a -> Bool 
  
      x /= y = not (x==y)
#+END_SRC
et comment on instancie cette classe de type.
#+BEGIN_SRC haskell
  instance Eq Bool where
      False == False = True 
      True  == True  = True 
      _ == _ = False 
#+END_SRC

*** instances de type dérivées
Lors de la création d'un type il est possible de les faire dériver  de classe existante et il aura alors les méthodes par défaut de ces classes.

La dérivation se fait comme suit:
#+BEGIN_SRC haskell
  data Bool = False | True
            deriving (Eq, Ord, Show, Read)
#+END_SRC

Cela veut dire que la classe de type Bool hérite automatiquement des méthodes de base des classe `Eq`, `Ord`, `Show` et `Read`.

** Exercices


