Jour5/manuel.tex

\subsubsection{Exercice n°2}
\label{sec:orge9507ba}
Définir de façon récursive les fonctions suivantes:

\begin{enumerate}
\item `et\_liste`
\label{sec:orge79f872}
\begin{verbatim}
et_liste :: [Bool] -> Bool 
\end{verbatim}
décide si tout les valeurs de la liste sont vraie

\item 'concatène'
\label{sec:org1c7e5c6}
\begin{verbatim}
concatène :: [[a]] -> [a]
\end{verbatim}
Concatène une liste de listes

\item 'est\_élément'
\label{sec:org3c59a87}
\begin{verbatim}
est_élément :: Eq a => a -> [a] -> Bool 
\end{verbatim}
Décide si un élément fait partie d'une liste.
\end{enumerate}

\subsubsection{Exercice n°3}
\label{sec:orgc463e76}
Définie une fonction récursive `fusionne`  qui rassemble deux listes en une seule triée.
\begin{verbatim}
fusionne :: Ord a => [a] -> [a] -> [a]
\end{verbatim}
par exemple
\begin{verbatim}
>merge [2,5,6] [1,3,4]
\end{verbatim}
\begin{verbatim}
[1,2,3,4,5,6]
\end{verbatim}

\section{Fonctions de haut-niveau (higher-order)}
\label{sec:org3bbe605}
Une fonction de haut-niveau est une fonction qui \textbf{prend d'autre(s) fonction(s) en paramètre}.

\subsection{Exemples de base}
\label{sec:org55e3385}
Les fonctions de ce types les plus courantes sont `map` et `filter`. 
`map`  applique la fonction passé en paramètre sur une liste d'éléments.
\begin{verbatim}
map (\x -> x^2) [1..5]
\end{verbatim}
\begin{verbatim}
[1,4,9,16,25]
\end{verbatim}


`filter` renvoie une liste d'élément sélectionné dans une autre liste selon un prédicat passé sous forme de fonction en paramètre, par exemple:

\begin{verbatim}
filter (\[x,y] -> x == y)  [ "aa", "ab", "Aa", "AA"] 
\end{verbatim}
\begin{verbatim}
["aa","AA"]
\end{verbatim}


Nous donnons maintenant des exemples courants de fonctions de haut-niveau.
\subsection{fold}
\label{sec:org1c88a9b}
\begin{itemize}
\item `foldr`  applique un opérateur sur une liste en allant de la droite à la gauche.  Elle est souvent appelée \emph{reduce} dans d'autre langage.
\end{itemize}
\begin{verbatim}
longueur :: [a] -> Int
longueur = flodr (\_ n -> 1 +n) 0
\end{verbatim}

\begin{itemize}
\item `foldl`:  applique un opérateur sur une liste en allant de la droite à la gauche.
\end{itemize}
\subsection{Composition}
\label{sec:orgf1e5a83}
L'opérateur `(.)` permet de faire de la composition de fonction.  Cela simplifie et de clarifie le code.   À la place de noter 
\begin{verbatim}
impaire n = not (paire n)
\end{verbatim}
on note
\begin{verbatim}
impaire  = not . pair
\end{verbatim}
À la place de 
\begin{verbatim}
repéter f x = f (f x)
\end{verbatim}
on écrit
\begin{verbatim}
répeter = f . f
\end{verbatim}
et à la place de 
\begin{verbatim}
somme_carré_positif ns = sum (map (^2) (filter paire ns))
\end{verbatim}
on écrira
\begin{verbatim}
somme_carré_positif = sum . map (^2) . filter pair
\end{verbatim}

\subsection{Exercices}
\label{sec:orgb68e5a1}

\subsubsection{Exercice n°1}
\label{sec:org8f0baaa}
Redéfinir la liste en compréhension \([f x | x <- xs, p x]\) en utilisant les fonctions de haut niveau `map` et `filter`
\begin{enumerate}
\item solution
\label{sec:orgbc95fa3}
\begin{verbatim}
-- [f x | x <- xs, p x] ?
exo1 :: (a -> b) -> [a] -> (a -> Bool) -> [b]
exo1 f xs p = [f x | x <- xs, p x]

exo1sol :: (a -> b) -> [a] -> (a -> Bool) -> [b]
exo1sol f xs p = map f (filter p xs)
-- map f filter p xs
\end{verbatim}
\end{enumerate}

\subsubsection{Exercice n°2}
\label{sec:org8f5f78c}
Redéfinir les fonctions `map f` et `filter p` en utilisant `foldr`

\begin{enumerate}
\item solution
\label{sec:org638f2fb}

\begin{verbatim}
-- exo3 redefine map f and filter p using foldr

map_ :: (a -> b) -> [a] -> [b]
map_ f xs = foldr apply_f [] xs
  where apply_f x y = (f x : y)

map__ :: (a -> b) -> [a] -> [b]
map__ f xs = foldr (\x y -> f x : y) [] xs


filter_ :: (a -> Bool) -> [a] -> [a]
filter_ p xs = foldr filter_p [] xs
  where filter_p x y
          | p x = (x:y)
          | otherwise = y
\end{verbatim}
\end{enumerate}

\subsubsection{Exercice n°3}
\label{sec:orgc201381}
En utilisant `foldl` définr la fonction dec2Int
qui converti une liste de nombre en entier
\begin{verbatim}
dec2Int :: [Int] -> Int
\end{verbatim}

\begin{verbatim}
dec2int [2,3,4,5]
\end{verbatim}
\begin{verbatim}
2345
\end{verbatim}

\begin{enumerate}
\item sol
\label{sec:org864334d}
\begin{verbatim}
-- exo 4 p. 105
-- Using foldl, deﬁne a function dec2int :: [Int] -> Int that converts a
-- decimal number into an integer. For example:

dec2int :: [Int] -> Int
dec2int xs = foldl (\x y -> 10 * x + y) 0 xs

\end{verbatim}
\end{enumerate}
\section{Déclaration des Types et des Classes}
\label{sec:org9209bac}
Les noms de types de classe \textbf{commencent avec une majuscule}.

\subsection{Comment déclarer de nouveau type}
\label{sec:org42d8661}
\subsubsection{types}
\label{sec:org4343605}
On peut les définir en utilisant des types existants
\begin{verbatim}
type Position = (Int, Int)
type Transistion = Pos -> Pos
\end{verbatim}

Les types récursifs sont interdits.
\begin{verbatim}
type Arbre = (Int, [Tree]) --interdit
\end{verbatim}

Par contre, on peut utiliser les classes de type
\begin{verbatim}
type Paire a = (a,a)
type Dico k v = [(k,v)]
\end{verbatim}
\subsubsection{data}
\label{sec:org39d9e6b}
`data` permet de créer un nouveau type en énumérant les différentes valeurs possibles.

\begin{verbatim}
data Déplacement = Nord | Sud | Est | Ouest deriving Show

déplace :: Déplacement -> Position -> Position
déplace North (x,y) = (x,y+1)
déplace Sud (x,y) = (x, y-1)
déplace Est (x,y) = (x+1,y)
déplace Ouest (x,y) = (x-1,y)
\end{verbatim}
`data` permet d'utiliser des variables et des paramètres.  Par exemple :
\begin{verbatim}
data Forme = Cercle Float | Rectangle Float Float

faire_carré :: Float -> Forme
faire_carré n = Rectangle n n

faire_cercle :: Float -> Forme
faire_cercle r = Cercle r

calculer_aire :: Forme -> Float
calculer_aire (Rectangle long larg) = long * larg
calculer_aire (Cercle r) = pi * r^2
\end{verbatim}
Ci-dessus, les constructeurs `Cercle` et `Rectangle` sont des fonctions constructeurs, à cause de leurs variables.  On le voit en demandant le type de `Cercle`.
\begin{verbatim}
:t Cercle
\end{verbatim}
\begin{verbatim}
Cercle :: Float -> Forme
\end{verbatim}


\begin{itemize}
\item un autre exemple de type avec une variable
\end{itemize}
\begin{verbatim}
data Maybe a = Nothing | Just a

division_securisée :: Int -> Int -> Maybe Int
division_securisée _ 0 :: Nothing
division_securisée m n = Just (m `div` n)
\end{verbatim}

\subsubsection{newtype}
\label{sec:orgdc38d3f}
La troisième façon de créer un type est en utilisant le mot clef `newtype`.
\begin{verbatim}
newtype Entier_Naturel = N Int
\end{verbatim}

\subsubsection{types récursifs}
\label{sec:org31e04eb}
Dans certains cas les définitions des types peuvent être récursives, par exemple
\begin{verbatim}
data Naturel = Zero | Succ Naturel deriving Show
data Arbre a = Feuille a | Noeud (Arbre a) a (Arbre a) deriving Show
\end{verbatim}

\subsection{Classes de type}
\label{sec:org032d8f8}
Les classes de types ne sont possible que pour les types déclarés avec `data` et `newtype`.

Voici comment on déclare un classe de type en Haskell
\begin{verbatim}
class Eq a where 
    (==), (/=) :: a -> a -> Bool 

    x /= y = not (x==y)
\end{verbatim}
et comment on instancie cette classe de type.
\begin{verbatim}
instance Eq Bool where
    False == False = True 
    True  == True  = True 
    _ == _ = False 
\end{verbatim}

\subsubsection{instances de type dérivées}
\label{sec:orga67ef43}
Lors de la création d'un type il est possible de les faire dériver  de classe existante et il aura alors les méthodes par défaut de ces classes.

La dérivation se fait comme suit:
\begin{verbatim}
data Bool = False | True
          deriving (Eq, Ord, Show, Read)
\end{verbatim}

Cela veut dire que la classe de type Bool hérite automatiquement des méthodes de base des classe `Eq`, `Ord`, `Show` et `Read`.

\subsection{Exercices}
\label{sec:org8e511b0}

\section{Annexes}
\label{sec:org724675b}
\end{document}